#अन्तर्भाव "types.h"

शून्य *
स_रखो(शून्य *dst, पूर्णांक c, uint n)
{
  अक्षर *cdst = (अक्षर *)dst;
  पूर्णांक i;
  साठी (i = 0; i < n; i++) {
    cdst[i] = c;
  }
  परत dst;
}

पूर्णांक
स_भेद(स्थिरांक शून्य *v1, स्थिरांक शून्य *v2, uint n)
{
  स्थिरांक uchar *s1, *s2;

  s1 = v1;
  s2 = v2;
  पर्यंत (n-- > 0) {
    जर (*s1 != *s2)
      परत *s1 - *s2;
    s1++, s2++;
  }

  परत 0;
}

शून्य *
स_हटाओ(शून्य *dst, स्थिरांक शून्य *src, uint n)
{
  स्थिरांक अक्षर *s;
  अक्षर *d;

  जर (n == 0)
    परत dst;

  s = src;
  d = dst;
  जर (s < d && s + n > d) {
    s += n;
    d += n;
    पर्यंत (n-- > 0)
      *--d = *--s;
  } अन्यथा
    पर्यंत (n-- > 0)
      *d++ = *s++;

  परत dst;
}

// memcpy exists to placate GCC.  Use memmove.
शून्य *
स_नकल(शून्य *dst, स्थिरांक शून्य *src, uint n)
{
  परत स_हटाओ(dst, src, n);
}

पूर्णांक
म_भेदन(स्थिरांक अक्षर *p, स्थिरांक अक्षर *q, uint n)
{
  पर्यंत (n > 0 && *p && *p == *q)
    n--, p++, q++;
  जर (n == 0)
    परत 0;
  परत (uchar)*p - (uchar)*q;
}

अक्षर *
म_नकलन(अक्षर *s, स्थिरांक अक्षर *t, पूर्णांक n)
{
  अक्षर *os;

  os = s;
  पर्यंत (n-- > 0 && (*s++ = *t++) != 0)
    ;
  पर्यंत (n-- > 0)
    *s++ = 0;
  परत os;
}

// Like strncpy but guaranteed to NUL-terminate.
अक्षर *
safestrcpy(अक्षर *s, स्थिरांक अक्षर *t, पूर्णांक n)
{
  अक्षर *os;

  os = s;
  जर (n <= 0)
    परत os;
  पर्यंत (--n > 0 && (*s++ = *t++) != 0)
    ;
  *s = 0;
  परत os;
}

पूर्णांक
म_माप(स्थिरांक अक्षर *s)
{
  पूर्णांक n;

  साठी (n = 0; s[n]; n++)
    ;
  परत n;
}
