#ಅನ್ತರ್ಭಾವ "types.h"

ಶೂನ್ಯ *
memset(ಶೂನ್ಯ *dst, ಪೂರ್ಣಾಂಕ c, uint n)
{
  ಅಕ್ಷರ *cdst = (ಅಕ್ಷರ *)dst;
  ಪೂರ್ಣಾಂಕ i;
  ಗಾಗಿ (i = 0; i < n; i++) {
    cdst[i] = c;
  }
  ಹಿಂತಿರುಗಿ dst;
}

ಪೂರ್ಣಾಂಕ
memcmp(ಸ್ಥಿರಾಂಕ ಶೂನ್ಯ *v1, ಸ್ಥಿರಾಂಕ ಶೂನ್ಯ *v2, uint n)
{
  ಸ್ಥಿರಾಂಕ uchar *s1, *s2;

  s1 = v1;
  s2 = v2;
  ಆಗ (n-- > 0) {
    ಆದರೆ (*s1 != *s2)
      ಹಿಂತಿರುಗಿ *s1 - *s2;
    s1++, s2++;
  }

  ಹಿಂತಿರುಗಿ 0;
}

ಶೂನ್ಯ *
memmove(ಶೂನ್ಯ *dst, ಸ್ಥಿರಾಂಕ ಶೂನ್ಯ *src, uint n)
{
  ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s;
  ಅಕ್ಷರ *d;

  ಆದರೆ (n == 0)
    ಹಿಂತಿರುಗಿ dst;

  s = src;
  d = dst;
  ಆದರೆ (s < d && s + n > d) {
    s += n;
    d += n;
    ಆಗ (n-- > 0)
      *--d = *--s;
  } ಇಲ್ಲದಿದ್ದರೆ
    ಆಗ (n-- > 0)
      *d++ = *s++;

  ಹಿಂತಿರುಗಿ dst;
}

// memcpy exists to placate GCC.  Use memmove.
ಶೂನ್ಯ *
ಸ್ಮರಣೆ_ನಕಲು(ಶೂನ್ಯ *dst, ಸ್ಥಿರಾಂಕ ಶೂನ್ಯ *src, uint n)
{
  ಹಿಂತಿರುಗಿ memmove(dst, src, n);
}

ಪೂರ್ಣಾಂಕ
ಅಕ್ಷರಸರಣಿ_ಹೋಲಿಕೆ(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *p, ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *q, uint n)
{
  ಆಗ (n > 0 && *p && *p == *q)
    n--, p++, q++;
  ಆದರೆ (n == 0)
    ಹಿಂತಿರುಗಿ 0;
  ಹಿಂತಿರುಗಿ (uchar)*p - (uchar)*q;
}

ಅಕ್ಷರ *
strncpy(ಅಕ್ಷರ *s, ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *t, ಪೂರ್ಣಾಂಕ n)
{
  ಅಕ್ಷರ *os;

  os = s;
  ಆಗ (n-- > 0 && (*s++ = *t++) != 0)
    ;
  ಆಗ (n-- > 0)
    *s++ = 0;
  ಹಿಂತಿರುಗಿ os;
}

// Like strncpy but guaranteed to NUL-terminate.
ಅಕ್ಷರ *
safestrcpy(ಅಕ್ಷರ *s, ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *t, ಪೂರ್ಣಾಂಕ n)
{
  ಅಕ್ಷರ *os;

  os = s;
  ಆದರೆ (n <= 0)
    ಹಿಂತಿರುಗಿ os;
  ಆಗ (--n > 0 && (*s++ = *t++) != 0)
    ;
  *s = 0;
  ಹಿಂತಿರುಗಿ os;
}

ಪೂರ್ಣಾಂಕ
ಅಕ್ಷರಸರಣಿ_ಉದ್ದ(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s)
{
  ಪೂರ್ಣಾಂಕ n;

  ಗಾಗಿ (n = 0; s[n]; n++)
    ;
  ಹಿಂತಿರುಗಿ n;
}
