#அந்தர்பாவ "types.h"

வெறுமை *
memset(வெறுமை *dst, முழு c, uint n)
{
  எழுத்து *cdst = (எழுத்து *)dst;
  முழு i;
  க்கு (i = 0; i < n; i++) {
    cdst[i] = c;
  }
  திரும்பு dst;
}

முழு
memcmp(மாறிலி வெறுமை *v1, மாறிலி வெறுமை *v2, uint n)
{
  மாறிலி uchar *s1, *s2;

  s1 = v1;
  s2 = v2;
  போது (n-- > 0) {
    எனில் (*s1 != *s2)
      திரும்பு *s1 - *s2;
    s1++, s2++;
  }

  திரும்பு 0;
}

வெறுமை *
memmove(வெறுமை *dst, மாறிலி வெறுமை *src, uint n)
{
  மாறிலி எழுத்து *s;
  எழுத்து *d;

  எனில் (n == 0)
    திரும்பு dst;

  s = src;
  d = dst;
  எனில் (s < d && s + n > d) {
    s += n;
    d += n;
    போது (n-- > 0)
      *--d = *--s;
  } இல்லையெனில்
    போது (n-- > 0)
      *d++ = *s++;

  திரும்பு dst;
}

// memcpy exists to placate GCC.  Use memmove.
வெறுமை *
memcpy(வெறுமை *dst, மாறிலி வெறுமை *src, uint n)
{
  திரும்பு memmove(dst, src, n);
}

முழு
strncmp(மாறிலி எழுத்து *p, மாறிலி எழுத்து *q, uint n)
{
  போது (n > 0 && *p && *p == *q)
    n--, p++, q++;
  எனில் (n == 0)
    திரும்பு 0;
  திரும்பு (uchar)*p - (uchar)*q;
}

எழுத்து *
strncpy(எழுத்து *s, மாறிலி எழுத்து *t, முழு n)
{
  எழுத்து *os;

  os = s;
  போது (n-- > 0 && (*s++ = *t++) != 0)
    ;
  போது (n-- > 0)
    *s++ = 0;
  திரும்பு os;
}

// Like strncpy but guaranteed to NUL-terminate.
எழுத்து *
safestrcpy(எழுத்து *s, மாறிலி எழுத்து *t, முழு n)
{
  எழுத்து *os;

  os = s;
  எனில் (n <= 0)
    திரும்பு os;
  போது (--n > 0 && (*s++ = *t++) != 0)
    ;
  *s = 0;
  திரும்பு os;
}

முழு
strlen(மாறிலி எழுத்து *s)
{
  முழு n;

  க்கு (n = 0; s[n]; n++)
    ;
  திரும்பு n;
}
