#অন্তর্ভাব "types.h"

শূন্য *
memset(শূন্য *dst, পূর্ণাঙ্ক c, uint n)
{
  বর্ণ *cdst = (বর্ণ *)dst;
  পূর্ণাঙ্ক i;
  প্রতি (i = 0; i < n; i++) {
    cdst[i] = c;
  }
  প্রত্যাগম dst;
}

পূর্ণাঙ্ক
memcmp(ধ্রুব শূন্য *v1, ধ্রুব শূন্য *v2, uint n)
{
  ধ্রুব uchar *s1, *s2;

  s1 = v1;
  s2 = v2;
  যাবত্ (n-- > 0) {
    যদি (*s1 != *s2)
      প্রত্যাগম *s1 - *s2;
    s1++, s2++;
  }

  প্রত্যাগম 0;
}

শূন্য *
memmove(শূন্য *dst, ধ্রুব শূন্য *src, uint n)
{
  ধ্রুব বর্ণ *s;
  বর্ণ *d;

  যদি (n == 0)
    প্রত্যাগম dst;

  s = src;
  d = dst;
  যদি (s < d && s + n > d) {
    s += n;
    d += n;
    যাবত্ (n-- > 0)
      *--d = *--s;
  } অন্যথা
    যাবত্ (n-- > 0)
      *d++ = *s++;

  প্রত্যাগম dst;
}

// memcpy exists to placate GCC.  Use memmove.
শূন্য *
memcpy(শূন্য *dst, ধ্রুব শূন্য *src, uint n)
{
  প্রত্যাগম memmove(dst, src, n);
}

পূর্ণাঙ্ক
strncmp(ধ্রুব বর্ণ *p, ধ্রুব বর্ণ *q, uint n)
{
  যাবত্ (n > 0 && *p && *p == *q)
    n--, p++, q++;
  যদি (n == 0)
    প্রত্যাগম 0;
  প্রত্যাগম (uchar)*p - (uchar)*q;
}

বর্ণ *
strncpy(বর্ণ *s, ধ্রুব বর্ণ *t, পূর্ণাঙ্ক n)
{
  বর্ণ *os;

  os = s;
  যাবত্ (n-- > 0 && (*s++ = *t++) != 0)
    ;
  যাবত্ (n-- > 0)
    *s++ = 0;
  প্রত্যাগম os;
}

// Like strncpy but guaranteed to NUL-terminate.
বর্ণ *
safestrcpy(বর্ণ *s, ধ্রুব বর্ণ *t, পূর্ণাঙ্ক n)
{
  বর্ণ *os;

  os = s;
  যদি (n <= 0)
    প্রত্যাগম os;
  যাবত্ (--n > 0 && (*s++ = *t++) != 0)
    ;
  *s = 0;
  প্রত্যাগম os;
}

পূর্ণাঙ্ক
strlen(ধ্রুব বর্ণ *s)
{
  পূর্ণাঙ্ক n;

  প্রতি (n = 0; s[n]; n++)
    ;
  প্রত্যাগম n;
}
