#अन्तर्भाव "types.h"

शून्य *
स_रखो(शून्य *dst, पूर्णाङ्क c, uint n)
{
  वर्ण *cdst = (वर्ण *)dst;
  पूर्णाङ्क i;
  लागि (i = 0; i < n; i++) {
    cdst[i] = c;
  }
  फर्काऊ dst;
}

पूर्णाङ्क
स_भेद(अचर शून्य *v1, अचर शून्य *v2, uint n)
{
  अचर uchar *s1, *s2;

  s1 = v1;
  s2 = v2;
  जबसम्म (n-- > 0) {
    यदि (*s1 != *s2)
      फर्काऊ *s1 - *s2;
    s1++, s2++;
  }

  फर्काऊ 0;
}

शून्य *
स_हटाओ(शून्य *dst, अचर शून्य *src, uint n)
{
  अचर वर्ण *s;
  वर्ण *d;

  यदि (n == 0)
    फर्काऊ dst;

  s = src;
  d = dst;
  यदि (s < d && s + n > d) {
    s += n;
    d += n;
    जबसम्म (n-- > 0)
      *--d = *--s;
  } अन्यथा
    जबसम्म (n-- > 0)
      *d++ = *s++;

  फर्काऊ dst;
}

// memcpy exists to placate GCC.  Use memmove.
शून्य *
स_नकल(शून्य *dst, अचर शून्य *src, uint n)
{
  फर्काऊ स_हटाओ(dst, src, n);
}

पूर्णाङ्क
म_भेदन(अचर वर्ण *p, अचर वर्ण *q, uint n)
{
  जबसम्म (n > 0 && *p && *p == *q)
    n--, p++, q++;
  यदि (n == 0)
    फर्काऊ 0;
  फर्काऊ (uchar)*p - (uchar)*q;
}

वर्ण *
म_नकलन(वर्ण *s, अचर वर्ण *t, पूर्णाङ्क n)
{
  वर्ण *os;

  os = s;
  जबसम्म (n-- > 0 && (*s++ = *t++) != 0)
    ;
  जबसम्म (n-- > 0)
    *s++ = 0;
  फर्काऊ os;
}

// Like strncpy but guaranteed to NUL-terminate.
वर्ण *
safestrcpy(वर्ण *s, अचर वर्ण *t, पूर्णाङ्क n)
{
  वर्ण *os;

  os = s;
  यदि (n <= 0)
    फर्काऊ os;
  जबसम्म (--n > 0 && (*s++ = *t++) != 0)
    ;
  *s = 0;
  फर्काऊ os;
}

पूर्णाङ्क
म_माप(अचर वर्ण *s)
{
  पूर्णाङ्क n;

  लागि (n = 0; s[n]; n++)
    ;
  फर्काऊ n;
}
