#അന്തര്ഭാവ "types.h"

ശൂന്യം *
memset(ശൂന്യം *dst, പൂർണ്ണസംഖ്യ c, uint n)
{
  അക്ഷരം *cdst = (അക്ഷരം *)dst;
  പൂർണ്ണസംഖ്യ i;
  വേണ്ടി (i = 0; i < n; i++) {
    cdst[i] = c;
  }
  തിരികെ dst;
}

പൂർണ്ണസംഖ്യ
memcmp(സ്ഥിരം ശൂന്യം *v1, സ്ഥിരം ശൂന്യം *v2, uint n)
{
  സ്ഥിരം uchar *s1, *s2;

  s1 = v1;
  s2 = v2;
  ആകുമ്പോൾ (n-- > 0) {
    എങ്കിൽ (*s1 != *s2)
      തിരികെ *s1 - *s2;
    s1++, s2++;
  }

  തിരികെ 0;
}

ശൂന്യം *
memmove(ശൂന്യം *dst, സ്ഥിരം ശൂന്യം *src, uint n)
{
  സ്ഥിരം അക്ഷരം *s;
  അക്ഷരം *d;

  എങ്കിൽ (n == 0)
    തിരികെ dst;

  s = src;
  d = dst;
  എങ്കിൽ (s < d && s + n > d) {
    s += n;
    d += n;
    ആകുമ്പോൾ (n-- > 0)
      *--d = *--s;
  } അല്ലെങ്കിൽ
    ആകുമ്പോൾ (n-- > 0)
      *d++ = *s++;

  തിരികെ dst;
}

// memcpy exists to placate GCC.  Use memmove.
ശൂന്യം *
memcpy(ശൂന്യം *dst, സ്ഥിരം ശൂന്യം *src, uint n)
{
  തിരികെ memmove(dst, src, n);
}

പൂർണ്ണസംഖ്യ
strncmp(സ്ഥിരം അക്ഷരം *p, സ്ഥിരം അക്ഷരം *q, uint n)
{
  ആകുമ്പോൾ (n > 0 && *p && *p == *q)
    n--, p++, q++;
  എങ്കിൽ (n == 0)
    തിരികെ 0;
  തിരികെ (uchar)*p - (uchar)*q;
}

അക്ഷരം *
strncpy(അക്ഷരം *s, സ്ഥിരം അക്ഷരം *t, പൂർണ്ണസംഖ്യ n)
{
  അക്ഷരം *os;

  os = s;
  ആകുമ്പോൾ (n-- > 0 && (*s++ = *t++) != 0)
    ;
  ആകുമ്പോൾ (n-- > 0)
    *s++ = 0;
  തിരികെ os;
}

// Like strncpy but guaranteed to NUL-terminate.
അക്ഷരം *
safestrcpy(അക്ഷരം *s, സ്ഥിരം അക്ഷരം *t, പൂർണ്ണസംഖ്യ n)
{
  അക്ഷരം *os;

  os = s;
  എങ്കിൽ (n <= 0)
    തിരികെ os;
  ആകുമ്പോൾ (--n > 0 && (*s++ = *t++) != 0)
    ;
  *s = 0;
  തിരികെ os;
}

പൂർണ്ണസംഖ്യ
strlen(സ്ഥിരം അക്ഷരം *s)
{
  പൂർണ്ണസംഖ്യ n;

  വേണ്ടി (n = 0; s[n]; n++)
    ;
  തിരികെ n;
}
