#ଅନ୍ତର୍ଭାଵ "types.h"

ଶୂନ୍ୟ *
memset(ଶୂନ୍ୟ *dst, ପୂର୍ଣ୍ଣସଂଖ୍ୟା c, uint n)
{
  ଅକ୍ଷର *cdst = (ଅକ୍ଷର *)dst;
  ପୂର୍ଣ୍ଣସଂଖ୍ୟା i;
  ପାଇଁ (i = 0; i < n; i++) {
    cdst[i] = c;
  }
  ଫେରନ୍ତୁ dst;
}

ପୂର୍ଣ୍ଣସଂଖ୍ୟା
memcmp(ଅଚଳ ଶୂନ୍ୟ *v1, ଅଚଳ ଶୂନ୍ୟ *v2, uint n)
{
  ଅଚଳ uchar *s1, *s2;

  s1 = v1;
  s2 = v2;
  ଯେତେବେଳେ (n-- > 0) {
    ଯଦି (*s1 != *s2)
      ଫେରନ୍ତୁ *s1 - *s2;
    s1++, s2++;
  }

  ଫେରନ୍ତୁ 0;
}

ଶୂନ୍ୟ *
memmove(ଶୂନ୍ୟ *dst, ଅଚଳ ଶୂନ୍ୟ *src, uint n)
{
  ଅଚଳ ଅକ୍ଷର *s;
  ଅକ୍ଷର *d;

  ଯଦି (n == 0)
    ଫେରନ୍ତୁ dst;

  s = src;
  d = dst;
  ଯଦି (s < d && s + n > d) {
    s += n;
    d += n;
    ଯେତେବେଳେ (n-- > 0)
      *--d = *--s;
  } ଅନ୍ୟଥା
    ଯେତେବେଳେ (n-- > 0)
      *d++ = *s++;

  ଫେରନ୍ତୁ dst;
}

// memcpy exists to placate GCC.  Use memmove.
ଶୂନ୍ୟ *
memcpy(ଶୂନ୍ୟ *dst, ଅଚଳ ଶୂନ୍ୟ *src, uint n)
{
  ଫେରନ୍ତୁ memmove(dst, src, n);
}

ପୂର୍ଣ୍ଣସଂଖ୍ୟା
strncmp(ଅଚଳ ଅକ୍ଷର *p, ଅଚଳ ଅକ୍ଷର *q, uint n)
{
  ଯେତେବେଳେ (n > 0 && *p && *p == *q)
    n--, p++, q++;
  ଯଦି (n == 0)
    ଫେରନ୍ତୁ 0;
  ଫେରନ୍ତୁ (uchar)*p - (uchar)*q;
}

ଅକ୍ଷର *
strncpy(ଅକ୍ଷର *s, ଅଚଳ ଅକ୍ଷର *t, ପୂର୍ଣ୍ଣସଂଖ୍ୟା n)
{
  ଅକ୍ଷର *os;

  os = s;
  ଯେତେବେଳେ (n-- > 0 && (*s++ = *t++) != 0)
    ;
  ଯେତେବେଳେ (n-- > 0)
    *s++ = 0;
  ଫେରନ୍ତୁ os;
}

// Like strncpy but guaranteed to NUL-terminate.
ଅକ୍ଷର *
safestrcpy(ଅକ୍ଷର *s, ଅଚଳ ଅକ୍ଷର *t, ପୂର୍ଣ୍ଣସଂଖ୍ୟା n)
{
  ଅକ୍ଷର *os;

  os = s;
  ଯଦି (n <= 0)
    ଫେରନ୍ତୁ os;
  ଯେତେବେଳେ (--n > 0 && (*s++ = *t++) != 0)
    ;
  *s = 0;
  ଫେରନ୍ତୁ os;
}

ପୂର୍ଣ୍ଣସଂଖ୍ୟା
strlen(ଅଚଳ ଅକ୍ଷର *s)
{
  ପୂର୍ଣ୍ଣସଂଖ୍ୟା n;

  ପାଇଁ (n = 0; s[n]; n++)
    ;
  ଫେରନ୍ତୁ n;
}
