#ಅನ್ತರ್ಭಾವ "types.h"

ಶೂನ್ಯ *
memset(ಶೂನ್ಯ *dst, ಪೂರ್ಣಾಙ್ಕ c, uint n)
{
  ವರ್ಣ *cdst = (ವರ್ಣ *)dst;
  ಪೂರ್ಣಾಙ್ಕ i;
  ಪ್ರತಿ (i = 0; i < n; i++) {
    cdst[i] = c;
  }
  ಪ್ರತ್ಯಾಗಮ dst;
}

ಪೂರ್ಣಾಙ್ಕ
memcmp(ಧ್ರುವ ಶೂನ್ಯ *v1, ಧ್ರುವ ಶೂನ್ಯ *v2, uint n)
{
  ಧ್ರುವ uchar *s1, *s2;

  s1 = v1;
  s2 = v2;
  ಯಾವತ್ (n-- > 0) {
    ಯದಿ (*s1 != *s2)
      ಪ್ರತ್ಯಾಗಮ *s1 - *s2;
    s1++, s2++;
  }

  ಪ್ರತ್ಯಾಗಮ 0;
}

ಶೂನ್ಯ *
memmove(ಶೂನ್ಯ *dst, ಧ್ರುವ ಶೂನ್ಯ *src, uint n)
{
  ಧ್ರುವ ವರ್ಣ *s;
  ವರ್ಣ *d;

  ಯದಿ (n == 0)
    ಪ್ರತ್ಯಾಗಮ dst;

  s = src;
  d = dst;
  ಯದಿ (s < d && s + n > d) {
    s += n;
    d += n;
    ಯಾವತ್ (n-- > 0)
      *--d = *--s;
  } ಅನ್ಯಥಾ
    ಯಾವತ್ (n-- > 0)
      *d++ = *s++;

  ಪ್ರತ್ಯಾಗಮ dst;
}

// memcpy exists to placate GCC.  Use memmove.
ಶೂನ್ಯ *
memcpy(ಶೂನ್ಯ *dst, ಧ್ರುವ ಶೂನ್ಯ *src, uint n)
{
  ಪ್ರತ್ಯಾಗಮ memmove(dst, src, n);
}

ಪೂರ್ಣಾಙ್ಕ
strncmp(ಧ್ರುವ ವರ್ಣ *p, ಧ್ರುವ ವರ್ಣ *q, uint n)
{
  ಯಾವತ್ (n > 0 && *p && *p == *q)
    n--, p++, q++;
  ಯದಿ (n == 0)
    ಪ್ರತ್ಯಾಗಮ 0;
  ಪ್ರತ್ಯಾಗಮ (uchar)*p - (uchar)*q;
}

ವರ್ಣ *
strncpy(ವರ್ಣ *s, ಧ್ರುವ ವರ್ಣ *t, ಪೂರ್ಣಾಙ್ಕ n)
{
  ವರ್ಣ *os;

  os = s;
  ಯಾವತ್ (n-- > 0 && (*s++ = *t++) != 0)
    ;
  ಯಾವತ್ (n-- > 0)
    *s++ = 0;
  ಪ್ರತ್ಯಾಗಮ os;
}

// Like strncpy but guaranteed to NUL-terminate.
ವರ್ಣ *
safestrcpy(ವರ್ಣ *s, ಧ್ರುವ ವರ್ಣ *t, ಪೂರ್ಣಾಙ್ಕ n)
{
  ವರ್ಣ *os;

  os = s;
  ಯದಿ (n <= 0)
    ಪ್ರತ್ಯಾಗಮ os;
  ಯಾವತ್ (--n > 0 && (*s++ = *t++) != 0)
    ;
  *s = 0;
  ಪ್ರತ್ಯಾಗಮ os;
}

ಪೂರ್ಣಾಙ್ಕ
strlen(ಧ್ರುವ ವರ್ಣ *s)
{
  ಪೂರ್ಣಾಙ್ಕ n;

  ಪ್ರತಿ (n = 0; s[n]; n++)
    ;
  ಪ್ರತ್ಯಾಗಮ n;
}
