#समावेश "types.h"

व्योम *
स_रखो(व्योम *dst, पूर्णांक c, uint n)
{
  अक्षर *cdst = (अक्षर *)dst;
  पूर्णांक i;
  क्रम (i = 0; i < n; i++) {
    cdst[i] = c;
  }
  वापस dst;
}

पूर्णांक
स_भेद(स्थिर व्योम *v1, स्थिर व्योम *v2, uint n)
{
  स्थिर uchar *s1, *s2;

  s1 = v1;
  s2 = v2;
  जबतक (n-- > 0) {
    अगर (*s1 != *s2)
      वापस *s1 - *s2;
    s1++, s2++;
  }

  वापस 0;
}

व्योम *
स_हटाओ(व्योम *dst, स्थिर व्योम *src, uint n)
{
  स्थिर अक्षर *s;
  अक्षर *d;

  अगर (n == 0)
    वापस dst;

  s = src;
  d = dst;
  अगर (s < d && s + n > d) {
    s += n;
    d += n;
    जबतक (n-- > 0)
      *--d = *--s;
  } अन्यथा
    जबतक (n-- > 0)
      *d++ = *s++;

  वापस dst;
}

// memcpy exists to placate GCC.  Use memmove.
व्योम *
स_नकल(व्योम *dst, स्थिर व्योम *src, uint n)
{
  वापस स_हटाओ(dst, src, n);
}

पूर्णांक
म_भेदन(स्थिर अक्षर *p, स्थिर अक्षर *q, uint n)
{
  जबतक (n > 0 && *p && *p == *q)
    n--, p++, q++;
  अगर (n == 0)
    वापस 0;
  वापस (uchar)*p - (uchar)*q;
}

अक्षर *
म_नकलन(अक्षर *s, स्थिर अक्षर *t, पूर्णांक n)
{
  अक्षर *os;

  os = s;
  जबतक (n-- > 0 && (*s++ = *t++) != 0)
    ;
  जबतक (n-- > 0)
    *s++ = 0;
  वापस os;
}

// Like strncpy but guaranteed to NUL-terminate.
अक्षर *
safestrcpy(अक्षर *s, स्थिर अक्षर *t, पूर्णांक n)
{
  अक्षर *os;

  os = s;
  अगर (n <= 0)
    वापस os;
  जबतक (--n > 0 && (*s++ = *t++) != 0)
    ;
  *s = 0;
  वापस os;
}

पूर्णांक
म_माप(स्थिर अक्षर *s)
{
  पूर्णांक n;

  क्रम (n = 0; s[n]; n++)
    ;
  वापस n;
}
