#అన్తర్భావ "types.h"

శూన్య *
memset(శూన్య *dst, పూర్ణాంకం c, uint n)
{
  అక్షరం *cdst = (అక్షరం *)dst;
  పూర్ణాంకం i;
  కొరకు (i = 0; i < n; i++) {
    cdst[i] = c;
  }
  తిరిగి dst;
}

పూర్ణాంకం
memcmp(స్థిరరాశి శూన్య *v1, స్థిరరాశి శూన్య *v2, uint n)
{
  స్థిరరాశి uchar *s1, *s2;

  s1 = v1;
  s2 = v2;
  అయితే (n-- > 0) {
    ఒకవేళ (*s1 != *s2)
      తిరిగి *s1 - *s2;
    s1++, s2++;
  }

  తిరిగి 0;
}

శూన్య *
memmove(శూన్య *dst, స్థిరరాశి శూన్య *src, uint n)
{
  స్థిరరాశి అక్షరం *s;
  అక్షరం *d;

  ఒకవేళ (n == 0)
    తిరిగి dst;

  s = src;
  d = dst;
  ఒకవేళ (s < d && s + n > d) {
    s += n;
    d += n;
    అయితే (n-- > 0)
      *--d = *--s;
  } లేకపోతే
    అయితే (n-- > 0)
      *d++ = *s++;

  తిరిగి dst;
}

// memcpy exists to placate GCC.  Use memmove.
శూన్య *
జ్ఞాపకం_నకలు(శూన్య *dst, స్థిరరాశి శూన్య *src, uint n)
{
  తిరిగి memmove(dst, src, n);
}

పూర్ణాంకం
అక్షరశ్రేణి_పోలిక(స్థిరరాశి అక్షరం *p, స్థిరరాశి అక్షరం *q, uint n)
{
  అయితే (n > 0 && *p && *p == *q)
    n--, p++, q++;
  ఒకవేళ (n == 0)
    తిరిగి 0;
  తిరిగి (uchar)*p - (uchar)*q;
}

అక్షరం *
strncpy(అక్షరం *s, స్థిరరాశి అక్షరం *t, పూర్ణాంకం n)
{
  అక్షరం *os;

  os = s;
  అయితే (n-- > 0 && (*s++ = *t++) != 0)
    ;
  అయితే (n-- > 0)
    *s++ = 0;
  తిరిగి os;
}

// Like strncpy but guaranteed to NUL-terminate.
అక్షరం *
safestrcpy(అక్షరం *s, స్థిరరాశి అక్షరం *t, పూర్ణాంకం n)
{
  అక్షరం *os;

  os = s;
  ఒకవేళ (n <= 0)
    తిరిగి os;
  అయితే (--n > 0 && (*s++ = *t++) != 0)
    ;
  *s = 0;
  తిరిగి os;
}

పూర్ణాంకం
అక్షరశ్రేణి_పొడవు(స్థిరరాశి అక్షరం *s)
{
  పూర్ణాంకం n;

  కొరకు (n = 0; s[n]; n++)
    ;
  తిరిగి n;
}
