#अन्तर्भाव "kernel/types.h"
#अन्तर्भाव "kernel/stat.h"
#अन्तर्भाव "user/user.h"

#अन्तर्भाव <stdarg.h>

स्थिर वर्ण digits[] = "0123456789ABCDEF";

स्थिर शून्य
अ_दो(पूर्णाङ्क fd, वर्ण c)
{
  लिख(fd, &c, 1);
}

स्थिर शून्य
printint(पूर्णाङ्क fd, दीर्घ दीर्घ xx, पूर्णाङ्क base, पूर्णाङ्क sgn)
{
  वर्ण buf[20];
  पूर्णाङ्क i, neg;
  अचिन्हित दीर्घ दीर्घ x;

  neg = 0;
  यदि (sgn && xx < 0) {
    neg = 1;
    x = -xx;
  } अन्यथा {
    x = xx;
  }

  i = 0;
  गर {
    buf[i++] = digits[x % base];
  } जबसम्म ((x /= base) != 0);
  यदि (neg)
    buf[i++] = '-';

  जबसम्म (--i >= 0)
    अ_दो(fd, buf[i]);
}

स्थिर शून्य
printptr(पूर्णाङ्क fd, uint64 x)
{
  पूर्णाङ्क i;
  अ_दो(fd, '0');
  अ_दो(fd, 'x');
  लागि (i = 0; i < (परिमाण(uint64) * 2); i++, x <<= 4)
    अ_दो(fd, digits[x >> (परिमाण(uint64) * 8 - 4)]);
}

// Print to the given fd. Only understands %d, %x, %p, %c, %s.
शून्य
भ_लिखो(पूर्णाङ्क fd, अचर वर्ण *fmt, बहु_सूची ap)
{
  वर्ण *s;
  पूर्णाङ्क c0, c1, c2, i, state;

  state = 0;
  लागि (i = 0; fmt[i]; i++) {
    c0 = fmt[i] & 0xff;
    यदि (state == 0) {
      यदि (c0 == '%') {
        state = '%';
      } अन्यथा {
        अ_दो(fd, c0);
      }
    } अन्यथा यदि (state == '%') {
      c1 = c2 = 0;
      यदि (c0)
        c1 = fmt[i + 1] & 0xff;
      यदि (c1)
        c2 = fmt[i + 2] & 0xff;
      यदि (c0 == 'd') {
        printint(fd, बहु_तर्क(ap, पूर्णाङ्क), 10, 1);
      } अन्यथा यदि (c0 == 'l' && c1 == 'd') {
        printint(fd, बहु_तर्क(ap, uint64), 10, 1);
        i += 1;
      } अन्यथा यदि (c0 == 'l' && c1 == 'l' && c2 == 'd') {
        printint(fd, बहु_तर्क(ap, uint64), 10, 1);
        i += 2;
      } अन्यथा यदि (c0 == 'u') {
        printint(fd, बहु_तर्क(ap, uint32), 10, 0);
      } अन्यथा यदि (c0 == 'l' && c1 == 'u') {
        printint(fd, बहु_तर्क(ap, uint64), 10, 0);
        i += 1;
      } अन्यथा यदि (c0 == 'l' && c1 == 'l' && c2 == 'u') {
        printint(fd, बहु_तर्क(ap, uint64), 10, 0);
        i += 2;
      } अन्यथा यदि (c0 == 'x') {
        printint(fd, बहु_तर्क(ap, uint32), 16, 0);
      } अन्यथा यदि (c0 == 'l' && c1 == 'x') {
        printint(fd, बहु_तर्क(ap, uint64), 16, 0);
        i += 1;
      } अन्यथा यदि (c0 == 'l' && c1 == 'l' && c2 == 'x') {
        printint(fd, बहु_तर्क(ap, uint64), 16, 0);
        i += 2;
      } अन्यथा यदि (c0 == 'p') {
        printptr(fd, बहु_तर्क(ap, uint64));
      } अन्यथा यदि (c0 == 'c') {
        अ_दो(fd, बहु_तर्क(ap, uint32));
      } अन्यथा यदि (c0 == 's') {
        यदि ((s = बहु_तर्क(ap, वर्ण *)) == 0)
          s = "(null)";
        लागि (; *s; s++)
          अ_दो(fd, *s);
      } अन्यथा यदि (c0 == '%') {
        अ_दो(fd, '%');
      } अन्यथा {
        // Unknown % sequence.  Print it to draw attention.
        अ_दो(fd, '%');
        अ_दो(fd, c0);
      }

      state = 0;
    }
  }
}

शून्य
ख_लिखो(पूर्णाङ्क fd, अचर वर्ण *fmt, ...)
{
  बहु_सूची ap;

  बहु_शुरू(ap, fmt);
  भ_लिखो(fd, fmt, ap);
}

शून्य
म_लिखो(अचर वर्ण *fmt, ...)
{
  बहु_सूची ap;

  बहु_शुरू(ap, fmt);
  भ_लिखो(1, fmt, ap);
}
