#समावेश "kernel/types.h"
#समावेश "kernel/stat.h"
#समावेश "user/user.h"

#समावेश <stdarg.h>

अटल अक्षर digits[] = "0123456789ABCDEF";

अटल व्योम
अ_दो(पूर्णांक fd, अक्षर c)
{
  ग_लिखो(fd, &c, 1);
}

अटल व्योम
printint(पूर्णांक fd, दीर्घ दीर्घ xx, पूर्णांक base, पूर्णांक sgn)
{
  अक्षर buf[20];
  पूर्णांक i, neg;
  अचिन्हित दीर्घ दीर्घ x;

  neg = 0;
  अगर (sgn && xx < 0) {
    neg = 1;
    x = -xx;
  } अन्यथा {
    x = xx;
  }

  i = 0;
  करो {
    buf[i++] = digits[x % base];
  } जबतक ((x /= base) != 0);
  अगर (neg)
    buf[i++] = '-';

  जबतक (--i >= 0)
    अ_दो(fd, buf[i]);
}

अटल व्योम
printptr(पूर्णांक fd, uint64 x)
{
  पूर्णांक i;
  अ_दो(fd, '0');
  अ_दो(fd, 'x');
  क्रम (i = 0; i < (माप(uint64) * 2); i++, x <<= 4)
    अ_दो(fd, digits[x >> (माप(uint64) * 8 - 4)]);
}

// Print to the given fd. Only understands %d, %x, %p, %c, %s.
व्योम
भ_लिखो(पूर्णांक fd, स्थिर अक्षर *fmt, बहु_सूची ap)
{
  अक्षर *s;
  पूर्णांक c0, c1, c2, i, state;

  state = 0;
  क्रम (i = 0; fmt[i]; i++) {
    c0 = fmt[i] & 0xff;
    अगर (state == 0) {
      अगर (c0 == '%') {
        state = '%';
      } अन्यथा {
        अ_दो(fd, c0);
      }
    } अन्यथा अगर (state == '%') {
      c1 = c2 = 0;
      अगर (c0)
        c1 = fmt[i + 1] & 0xff;
      अगर (c1)
        c2 = fmt[i + 2] & 0xff;
      अगर (c0 == 'd') {
        printint(fd, बहु_तर्क(ap, पूर्णांक), 10, 1);
      } अन्यथा अगर (c0 == 'l' && c1 == 'd') {
        printint(fd, बहु_तर्क(ap, uint64), 10, 1);
        i += 1;
      } अन्यथा अगर (c0 == 'l' && c1 == 'l' && c2 == 'd') {
        printint(fd, बहु_तर्क(ap, uint64), 10, 1);
        i += 2;
      } अन्यथा अगर (c0 == 'u') {
        printint(fd, बहु_तर्क(ap, uint32), 10, 0);
      } अन्यथा अगर (c0 == 'l' && c1 == 'u') {
        printint(fd, बहु_तर्क(ap, uint64), 10, 0);
        i += 1;
      } अन्यथा अगर (c0 == 'l' && c1 == 'l' && c2 == 'u') {
        printint(fd, बहु_तर्क(ap, uint64), 10, 0);
        i += 2;
      } अन्यथा अगर (c0 == 'x') {
        printint(fd, बहु_तर्क(ap, uint32), 16, 0);
      } अन्यथा अगर (c0 == 'l' && c1 == 'x') {
        printint(fd, बहु_तर्क(ap, uint64), 16, 0);
        i += 1;
      } अन्यथा अगर (c0 == 'l' && c1 == 'l' && c2 == 'x') {
        printint(fd, बहु_तर्क(ap, uint64), 16, 0);
        i += 2;
      } अन्यथा अगर (c0 == 'p') {
        printptr(fd, बहु_तर्क(ap, uint64));
      } अन्यथा अगर (c0 == 'c') {
        अ_दो(fd, बहु_तर्क(ap, uint32));
      } अन्यथा अगर (c0 == 's') {
        अगर ((s = बहु_तर्क(ap, अक्षर *)) == 0)
          s = "(null)";
        क्रम (; *s; s++)
          अ_दो(fd, *s);
      } अन्यथा अगर (c0 == '%') {
        अ_दो(fd, '%');
      } अन्यथा {
        // Unknown % sequence.  Print it to draw attention.
        अ_दो(fd, '%');
        अ_दो(fd, c0);
      }

      state = 0;
    }
  }
}

व्योम
ख_लिखो(पूर्णांक fd, स्थिर अक्षर *fmt, ...)
{
  बहु_सूची ap;

  बहु_शुरू(ap, fmt);
  भ_लिखो(fd, fmt, ap);
}

व्योम
म_लिखो(स्थिर अक्षर *fmt, ...)
{
  बहु_सूची ap;

  बहु_शुरू(ap, fmt);
  भ_लिखो(1, fmt, ap);
}
