#अन्तर्भाव "kernel/types.h"
#अन्तर्भाव "kernel/stat.h"
#अन्तर्भाव "user/user.h"

#अन्तर्भाव <stdarg.h>

स्थिर अक्षर digits[] = "0123456789ABCDEF";

स्थिर शून्य
अ_दो(पूर्णांक fd, अक्षर c)
{
  लिख(fd, &c, 1);
}

स्थिर शून्य
printint(पूर्णांक fd, दीर्घ दीर्घ xx, पूर्णांक base, पूर्णांक sgn)
{
  अक्षर buf[20];
  पूर्णांक i, neg;
  अचिन्हित दीर्घ दीर्घ x;

  neg = 0;
  जर (sgn && xx < 0) {
    neg = 1;
    x = -xx;
  } अन्यथा {
    x = xx;
  }

  i = 0;
  करा {
    buf[i++] = digits[x % base];
  } पर्यंत ((x /= base) != 0);
  जर (neg)
    buf[i++] = '-';

  पर्यंत (--i >= 0)
    अ_दो(fd, buf[i]);
}

स्थिर शून्य
printptr(पूर्णांक fd, uint64 x)
{
  पूर्णांक i;
  अ_दो(fd, '0');
  अ_दो(fd, 'x');
  साठी (i = 0; i < (आकार(uint64) * 2); i++, x <<= 4)
    अ_दो(fd, digits[x >> (आकार(uint64) * 8 - 4)]);
}

// Print to the given fd. Only understands %d, %x, %p, %c, %s.
शून्य
भ_लिखो(पूर्णांक fd, स्थिरांक अक्षर *fmt, बहु_सूची ap)
{
  अक्षर *s;
  पूर्णांक c0, c1, c2, i, state;

  state = 0;
  साठी (i = 0; fmt[i]; i++) {
    c0 = fmt[i] & 0xff;
    जर (state == 0) {
      जर (c0 == '%') {
        state = '%';
      } अन्यथा {
        अ_दो(fd, c0);
      }
    } अन्यथा जर (state == '%') {
      c1 = c2 = 0;
      जर (c0)
        c1 = fmt[i + 1] & 0xff;
      जर (c1)
        c2 = fmt[i + 2] & 0xff;
      जर (c0 == 'd') {
        printint(fd, बहु_तर्क(ap, पूर्णांक), 10, 1);
      } अन्यथा जर (c0 == 'l' && c1 == 'd') {
        printint(fd, बहु_तर्क(ap, uint64), 10, 1);
        i += 1;
      } अन्यथा जर (c0 == 'l' && c1 == 'l' && c2 == 'd') {
        printint(fd, बहु_तर्क(ap, uint64), 10, 1);
        i += 2;
      } अन्यथा जर (c0 == 'u') {
        printint(fd, बहु_तर्क(ap, uint32), 10, 0);
      } अन्यथा जर (c0 == 'l' && c1 == 'u') {
        printint(fd, बहु_तर्क(ap, uint64), 10, 0);
        i += 1;
      } अन्यथा जर (c0 == 'l' && c1 == 'l' && c2 == 'u') {
        printint(fd, बहु_तर्क(ap, uint64), 10, 0);
        i += 2;
      } अन्यथा जर (c0 == 'x') {
        printint(fd, बहु_तर्क(ap, uint32), 16, 0);
      } अन्यथा जर (c0 == 'l' && c1 == 'x') {
        printint(fd, बहु_तर्क(ap, uint64), 16, 0);
        i += 1;
      } अन्यथा जर (c0 == 'l' && c1 == 'l' && c2 == 'x') {
        printint(fd, बहु_तर्क(ap, uint64), 16, 0);
        i += 2;
      } अन्यथा जर (c0 == 'p') {
        printptr(fd, बहु_तर्क(ap, uint64));
      } अन्यथा जर (c0 == 'c') {
        अ_दो(fd, बहु_तर्क(ap, uint32));
      } अन्यथा जर (c0 == 's') {
        जर ((s = बहु_तर्क(ap, अक्षर *)) == 0)
          s = "(null)";
        साठी (; *s; s++)
          अ_दो(fd, *s);
      } अन्यथा जर (c0 == '%') {
        अ_दो(fd, '%');
      } अन्यथा {
        // Unknown % sequence.  Print it to draw attention.
        अ_दो(fd, '%');
        अ_दो(fd, c0);
      }

      state = 0;
    }
  }
}

शून्य
ख_लिखो(पूर्णांक fd, स्थिरांक अक्षर *fmt, ...)
{
  बहु_सूची ap;

  बहु_शुरू(ap, fmt);
  भ_लिखो(fd, fmt, ap);
}

शून्य
म_लिखो(स्थिरांक अक्षर *fmt, ...)
{
  बहु_सूची ap;

  बहु_शुरू(ap, fmt);
  भ_लिखो(1, fmt, ap);
}
