#ଅନ୍ତର୍ଭାଵ "kernel/types.h"
#ଅନ୍ତର୍ଭାଵ "kernel/stat.h"
#ଅନ୍ତର୍ଭାଵ "kernel/fcntl.h"
#ଅନ୍ତର୍ଭାଵ "kernel/riscv.h"
#ଅନ୍ତର୍ଭାଵ "kernel/vm.h"
#ଅନ୍ତର୍ଭାଵ "user/user.h"

//
// wrapper so that it's OK if main() does not call exit().
//
ଶୂନ୍ୟ
start(ପୂର୍ଣ୍ଣସଂଖ୍ୟା argc, ଅକ୍ଷର **argv)
{
  ପୂର୍ଣ୍ଣସଂଖ୍ୟା r;
  ବାହ୍ୟ ପୂର୍ଣ୍ଣସଂଖ୍ୟା ମୁଖ୍ୟ(ପୂର୍ଣ୍ଣସଂଖ୍ୟା argc, ଅକ୍ଷର **argv);
  r = ମୁଖ୍ୟ(argc, argv);
  exit(r);
}

ଅକ୍ଷର *
strcpy(ଅକ୍ଷର *s, ଅଚଳ ଅକ୍ଷର *t)
{
  ଅକ୍ଷର *os;

  os = s;
  ଯେତେବେଳେ ((*s++ = *t++) != 0)
    ;
  ଫେରନ୍ତୁ os;
}

ପୂର୍ଣ୍ଣସଂଖ୍ୟା
strcmp(ଅଚଳ ଅକ୍ଷର *p, ଅଚଳ ଅକ୍ଷର *q)
{
  ଯେତେବେଳେ (*p && *p == *q)
    p++, q++;
  ଫେରନ୍ତୁ (uchar)*p - (uchar)*q;
}

uint
strlen(ଅଚଳ ଅକ୍ଷର *s)
{
  ପୂର୍ଣ୍ଣସଂଖ୍ୟା n;

  ପାଇଁ (n = 0; s[n]; n++)
    ;
  ଫେରନ୍ତୁ n;
}

ଶୂନ୍ୟ *
memset(ଶୂନ୍ୟ *dst, ପୂର୍ଣ୍ଣସଂଖ୍ୟା c, uint n)
{
  ଅକ୍ଷର *cdst = (ଅକ୍ଷର *)dst;
  ପୂର୍ଣ୍ଣସଂଖ୍ୟା i;
  ପାଇଁ (i = 0; i < n; i++) {
    cdst[i] = c;
  }
  ଫେରନ୍ତୁ dst;
}

ଅକ୍ଷର *
strchr(ଅଚଳ ଅକ୍ଷର *s, ଅକ୍ଷର c)
{
  ପାଇଁ (; *s; s++)
    ଯଦି (*s == c)
      ଫେରନ୍ତୁ (ଅକ୍ଷର *)s;
  ଫେରନ୍ତୁ 0;
}

ଅକ୍ଷର *
gets(ଅକ୍ଷର *buf, ପୂର୍ଣ୍ଣସଂଖ୍ୟା max)
{
  ପୂର୍ଣ୍ଣସଂଖ୍ୟା i, cc;
  ଅକ୍ଷର c;

  ପାଇଁ (i = 0; i + 1 < max;) {
    cc = ପଠ(0, &c, 1);
    ଯଦି (cc < 1)
      ଭାଙ୍ଗ;
    buf[i++] = c;
    ଯଦି (c == '\n' || c == '\r')
      ଭାଙ୍ଗ;
  }
  buf[i] = '\0';
  ଫେରନ୍ତୁ buf;
}

ପୂର୍ଣ୍ଣସଂଖ୍ୟା
stat(ଅଚଳ ଅକ୍ଷର *n, ସଂରଚନା stat *st)
{
  ପୂର୍ଣ୍ଣସଂଖ୍ୟା fd;
  ପୂର୍ଣ୍ଣସଂଖ୍ୟା r;

  fd = open(n, O_RDONLY);
  ଯଦି (fd < 0)
    ଫେରନ୍ତୁ -1;
  r = fstat(fd, st);
  close(fd);
  ଫେରନ୍ତୁ r;
}

ପୂର୍ଣ୍ଣସଂଖ୍ୟା
atoi(ଅଚଳ ଅକ୍ଷର *s)
{
  ପୂର୍ଣ୍ଣସଂଖ୍ୟା n;

  n = 0;
  ଯେତେବେଳେ ('0' <= *s && *s <= '9')
    n = n * 10 + *s++ - '0';
  ଫେରନ୍ତୁ n;
}

ଶୂନ୍ୟ *
memmove(ଶୂନ୍ୟ *vdst, ଅଚଳ ଶୂନ୍ୟ *vsrc, ପୂର୍ଣ୍ଣସଂଖ୍ୟା n)
{
  ଅକ୍ଷର *dst;
  ଅଚଳ ଅକ୍ଷର *src;

  dst = vdst;
  src = vsrc;
  ଯଦି (src > dst) {
    ଯେତେବେଳେ (n-- > 0)
      *dst++ = *src++;
  } ଅନ୍ୟଥା {
    dst += n;
    src += n;
    ଯେତେବେଳେ (n-- > 0)
      *--dst = *--src;
  }
  ଫେରନ୍ତୁ vdst;
}

ପୂର୍ଣ୍ଣସଂଖ୍ୟା
memcmp(ଅଚଳ ଶୂନ୍ୟ *s1, ଅଚଳ ଶୂନ୍ୟ *s2, uint n)
{
  ଅଚଳ ଅକ୍ଷର *p1 = s1, *p2 = s2;
  ଯେତେବେଳେ (n-- > 0) {
    ଯଦି (*p1 != *p2) {
      ଫେରନ୍ତୁ *p1 - *p2;
    }
    p1++;
    p2++;
  }
  ଫେରନ୍ତୁ 0;
}

ଶୂନ୍ୟ *
memcpy(ଶୂନ୍ୟ *dst, ଅଚଳ ଶୂନ୍ୟ *src, uint n)
{
  ଫେରନ୍ତୁ memmove(dst, src, n);
}

ଅକ୍ଷର *
sbrk(ପୂର୍ଣ୍ଣସଂଖ୍ୟା n)
{
  ଫେରନ୍ତୁ sys_sbrk(n, SBRK_EAGER);
}

ଅକ୍ଷର *
sbrklazy(ପୂର୍ଣ୍ଣସଂଖ୍ୟା n)
{
  ଫେରନ୍ତୁ sys_sbrk(n, SBRK_LAZY);
}
