#अन्तर्भाव "kernel/types.h"
#अन्तर्भाव "kernel/stat.h"
#अन्तर्भाव "kernel/fcntl.h"
#अन्तर्भाव "kernel/riscv.h"
#अन्तर्भाव "kernel/vm.h"
#अन्तर्भाव "user/user.h"

//
// wrapper so that it's OK if main() does not call exit().
//
शून्य
start(पूर्णाङ्क argc, वर्ण **argv)
{
  पूर्णाङ्क r;
  बाह्य पूर्णाङ्क main(पूर्णाङ्क argc, वर्ण **argv);
  r = main(argc, argv);
  निकास(r);
}

वर्ण *
म_नकल(वर्ण *s, अचर वर्ण *t)
{
  वर्ण *os;

  os = s;
  जबसम्म ((*s++ = *t++) != 0)
    ;
  फर्काऊ os;
}

पूर्णाङ्क
म_भेद(अचर वर्ण *p, अचर वर्ण *q)
{
  जबसम्म (*p && *p == *q)
    p++, q++;
  फर्काऊ (uchar)*p - (uchar)*q;
}

uint
म_माप(अचर वर्ण *s)
{
  पूर्णाङ्क n;

  लागि (n = 0; s[n]; n++)
    ;
  फर्काऊ n;
}

शून्य *
स_रखो(शून्य *dst, पूर्णाङ्क c, uint n)
{
  वर्ण *cdst = (वर्ण *)dst;
  पूर्णाङ्क i;
  लागि (i = 0; i < n; i++) {
    cdst[i] = c;
  }
  फर्काऊ dst;
}

वर्ण *
म_अक्षर(अचर वर्ण *s, वर्ण c)
{
  लागि (; *s; s++)
    यदि (*s == c)
      फर्काऊ (वर्ण *)s;
  फर्काऊ 0;
}

वर्ण *
माला_लो(वर्ण *buf, पूर्णाङ्क max)
{
  पूर्णाङ्क i, cc;
  वर्ण c;

  लागि (i = 0; i + 1 < max;) {
    cc = पठ(0, &c, 1);
    यदि (cc < 1)
      रोक;
    buf[i++] = c;
    यदि (c == '\n' || c == '\r')
      रोक;
  }
  buf[i] = '\0';
  फर्काऊ buf;
}

पूर्णाङ्क
stat(अचर वर्ण *n, संरचना stat *st)
{
  पूर्णाङ्क fd;
  पूर्णाङ्क r;

  fd = खोलो(n, O_RDONLY);
  यदि (fd < 0)
    फर्काऊ -1;
  r = ख_स्थिति(fd, st);
  बंद(fd);
  फर्काऊ r;
}

पूर्णाङ्क
म_से_प(अचर वर्ण *s)
{
  पूर्णाङ्क n;

  n = 0;
  जबसम्म ('0' <= *s && *s <= '9')
    n = n * 10 + *s++ - '0';
  फर्काऊ n;
}

शून्य *
स_हटाओ(शून्य *vdst, अचर शून्य *vsrc, पूर्णाङ्क n)
{
  वर्ण *dst;
  अचर वर्ण *src;

  dst = vdst;
  src = vsrc;
  यदि (src > dst) {
    जबसम्म (n-- > 0)
      *dst++ = *src++;
  } अन्यथा {
    dst += n;
    src += n;
    जबसम्म (n-- > 0)
      *--dst = *--src;
  }
  फर्काऊ vdst;
}

पूर्णाङ्क
स_भेद(अचर शून्य *s1, अचर शून्य *s2, uint n)
{
  अचर वर्ण *p1 = s1, *p2 = s2;
  जबसम्म (n-- > 0) {
    यदि (*p1 != *p2) {
      फर्काऊ *p1 - *p2;
    }
    p1++;
    p2++;
  }
  फर्काऊ 0;
}

शून्य *
स_नकल(शून्य *dst, अचर शून्य *src, uint n)
{
  फर्काऊ स_हटाओ(dst, src, n);
}

वर्ण *
sbrk(पूर्णाङ्क n)
{
  फर्काऊ sys_sbrk(n, SBRK_EAGER);
}

वर्ण *
sbrklazy(पूर्णाङ्क n)
{
  फर्काऊ sys_sbrk(n, SBRK_LAZY);
}
