#ಅನ್ತರ್ಭಾವ "kernel/types.h"
#ಅನ್ತರ್ಭಾವ "kernel/stat.h"
#ಅನ್ತರ್ಭಾವ "kernel/fcntl.h"
#ಅನ್ತರ್ಭಾವ "kernel/riscv.h"
#ಅನ್ತರ್ಭಾವ "kernel/vm.h"
#ಅನ್ತರ್ಭಾವ "user/user.h"

//
// wrapper so that it's OK if main() does not call exit().
//
ಶೂನ್ಯ
ಆರಂಭ(ಪೂರ್ಣಾಂಕ argc, ಅಕ್ಷರ **argv)
{
  ಪೂರ್ಣಾಂಕ r;
  ಬಾಹ್ಯ ಪೂರ್ಣಾಂಕ ಮುಖ್ಯ(ಪೂರ್ಣಾಂಕ argc, ಅಕ್ಷರ **argv);
  r = ಮುಖ್ಯ(argc, argv);
  ನಿರ್ಗಮಿಸು(r);
}

ಅಕ್ಷರ *
strcpy(ಅಕ್ಷರ *s, ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *t)
{
  ಅಕ್ಷರ *os;

  os = s;
  ಆಗ ((*s++ = *t++) != 0)
    ;
  ಹಿಂತಿರುಗಿ os;
}

ಪೂರ್ಣಾಂಕ
strcmp(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *p, ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *q)
{
  ಆಗ (*p && *p == *q)
    p++, q++;
  ಹಿಂತಿರುಗಿ (uchar)*p - (uchar)*q;
}

uint
ಅಕ್ಷರಸರಣಿ_ಉದ್ದ(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s)
{
  ಪೂರ್ಣಾಂಕ n;

  ಗಾಗಿ (n = 0; s[n]; n++)
    ;
  ಹಿಂತಿರುಗಿ n;
}

ಶೂನ್ಯ *
memset(ಶೂನ್ಯ *dst, ಪೂರ್ಣಾಂಕ c, uint n)
{
  ಅಕ್ಷರ *cdst = (ಅಕ್ಷರ *)dst;
  ಪೂರ್ಣಾಂಕ i;
  ಗಾಗಿ (i = 0; i < n; i++) {
    cdst[i] = c;
  }
  ಹಿಂತಿರುಗಿ dst;
}

ಅಕ್ಷರ *
strchr(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s, ಅಕ್ಷರ c)
{
  ಗಾಗಿ (; *s; s++)
    ಆದರೆ (*s == c)
      ಹಿಂತಿರುಗಿ (ಅಕ್ಷರ *)s;
  ಹಿಂತಿರುಗಿ 0;
}

ಅಕ್ಷರ *
gets(ಅಕ್ಷರ *buf, ಪೂರ್ಣಾಂಕ max)
{
  ಪೂರ್ಣಾಂಕ i, cc;
  ಅಕ್ಷರ c;

  ಗಾಗಿ (i = 0; i + 1 < max;) {
    cc = ಪಠ(0, &c, 1);
    ಆದರೆ (cc < 1)
      ನಿಲ್ಲಿಸು;
    buf[i++] = c;
    ಆದರೆ (c == '\n' || c == '\r')
      ನಿಲ್ಲಿಸು;
  }
  buf[i] = '\0';
  ಹಿಂತಿರುಗಿ buf;
}

ಪೂರ್ಣಾಂಕ
stat(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *n, ರಚನೆ stat *st)
{
  ಪೂರ್ಣಾಂಕ fd;
  ಪೂರ್ಣಾಂಕ r;

  fd = open(n, O_RDONLY);
  ಆದರೆ (fd < 0)
    ಹಿಂತಿರುಗಿ -1;
  r = fstat(fd, st);
  close(fd);
  ಹಿಂತಿರುಗಿ r;
}

ಪೂರ್ಣಾಂಕ
atoi(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *s)
{
  ಪೂರ್ಣಾಂಕ n;

  n = 0;
  ಆಗ ('0' <= *s && *s <= '9')
    n = n * 10 + *s++ - '0';
  ಹಿಂತಿರುಗಿ n;
}

ಶೂನ್ಯ *
memmove(ಶೂನ್ಯ *vdst, ಸ್ಥಿರಾಂಕ ಶೂನ್ಯ *vsrc, ಪೂರ್ಣಾಂಕ n)
{
  ಅಕ್ಷರ *dst;
  ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *src;

  dst = vdst;
  src = vsrc;
  ಆದರೆ (src > dst) {
    ಆಗ (n-- > 0)
      *dst++ = *src++;
  } ಇಲ್ಲದಿದ್ದರೆ {
    dst += n;
    src += n;
    ಆಗ (n-- > 0)
      *--dst = *--src;
  }
  ಹಿಂತಿರುಗಿ vdst;
}

ಪೂರ್ಣಾಂಕ
memcmp(ಸ್ಥಿರಾಂಕ ಶೂನ್ಯ *s1, ಸ್ಥಿರಾಂಕ ಶೂನ್ಯ *s2, uint n)
{
  ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *p1 = s1, *p2 = s2;
  ಆಗ (n-- > 0) {
    ಆದರೆ (*p1 != *p2) {
      ಹಿಂತಿರುಗಿ *p1 - *p2;
    }
    p1++;
    p2++;
  }
  ಹಿಂತಿರುಗಿ 0;
}

ಶೂನ್ಯ *
ಸ್ಮರಣೆ_ನಕಲು(ಶೂನ್ಯ *dst, ಸ್ಥಿರಾಂಕ ಶೂನ್ಯ *src, uint n)
{
  ಹಿಂತಿರುಗಿ memmove(dst, src, n);
}

ಅಕ್ಷರ *
sbrk(ಪೂರ್ಣಾಂಕ n)
{
  ಹಿಂತಿರುಗಿ sys_sbrk(n, SBRK_EAGER);
}

ಅಕ್ಷರ *
sbrklazy(ಪೂರ್ಣಾಂಕ n)
{
  ಹಿಂತಿರುಗಿ sys_sbrk(n, SBRK_LAZY);
}
