#അന്തര്ഭാവ "kernel/types.h"
#അന്തര്ഭാവ "kernel/stat.h"
#അന്തര്ഭാവ "kernel/fcntl.h"
#അന്തര്ഭാവ "kernel/riscv.h"
#അന്തര്ഭാവ "kernel/vm.h"
#അന്തര്ഭാവ "user/user.h"

//
// wrapper so that it's OK if main() does not call exit().
//
ശൂന്യം
start(പൂർണ്ണസംഖ്യ argc, അക്ഷരം **argv)
{
  പൂർണ്ണസംഖ്യ r;
  ബാഹ്യ പൂർണ്ണസംഖ്യ പ്രധാന(പൂർണ്ണസംഖ്യ argc, അക്ഷരം **argv);
  r = പ്രധാന(argc, argv);
  exit(r);
}

അക്ഷരം *
strcpy(അക്ഷരം *s, സ്ഥിരം അക്ഷരം *t)
{
  അക്ഷരം *os;

  os = s;
  ആകുമ്പോൾ ((*s++ = *t++) != 0)
    ;
  തിരികെ os;
}

പൂർണ്ണസംഖ്യ
strcmp(സ്ഥിരം അക്ഷരം *p, സ്ഥിരം അക്ഷരം *q)
{
  ആകുമ്പോൾ (*p && *p == *q)
    p++, q++;
  തിരികെ (uchar)*p - (uchar)*q;
}

uint
strlen(സ്ഥിരം അക്ഷരം *s)
{
  പൂർണ്ണസംഖ്യ n;

  വേണ്ടി (n = 0; s[n]; n++)
    ;
  തിരികെ n;
}

ശൂന്യം *
memset(ശൂന്യം *dst, പൂർണ്ണസംഖ്യ c, uint n)
{
  അക്ഷരം *cdst = (അക്ഷരം *)dst;
  പൂർണ്ണസംഖ്യ i;
  വേണ്ടി (i = 0; i < n; i++) {
    cdst[i] = c;
  }
  തിരികെ dst;
}

അക്ഷരം *
strchr(സ്ഥിരം അക്ഷരം *s, അക്ഷരം c)
{
  വേണ്ടി (; *s; s++)
    എങ്കിൽ (*s == c)
      തിരികെ (അക്ഷരം *)s;
  തിരികെ 0;
}

അക്ഷരം *
gets(അക്ഷരം *buf, പൂർണ്ണസംഖ്യ max)
{
  പൂർണ്ണസംഖ്യ i, cc;
  അക്ഷരം c;

  വേണ്ടി (i = 0; i + 1 < max;) {
    cc = പഠ(0, &c, 1);
    എങ്കിൽ (cc < 1)
      നിർത്തുക;
    buf[i++] = c;
    എങ്കിൽ (c == '\n' || c == '\r')
      നിർത്തുക;
  }
  buf[i] = '\0';
  തിരികെ buf;
}

പൂർണ്ണസംഖ്യ
stat(സ്ഥിരം അക്ഷരം *n, ഘടന stat *st)
{
  പൂർണ്ണസംഖ്യ fd;
  പൂർണ്ണസംഖ്യ r;

  fd = open(n, O_RDONLY);
  എങ്കിൽ (fd < 0)
    തിരികെ -1;
  r = fstat(fd, st);
  close(fd);
  തിരികെ r;
}

പൂർണ്ണസംഖ്യ
atoi(സ്ഥിരം അക്ഷരം *s)
{
  പൂർണ്ണസംഖ്യ n;

  n = 0;
  ആകുമ്പോൾ ('0' <= *s && *s <= '9')
    n = n * 10 + *s++ - '0';
  തിരികെ n;
}

ശൂന്യം *
memmove(ശൂന്യം *vdst, സ്ഥിരം ശൂന്യം *vsrc, പൂർണ്ണസംഖ്യ n)
{
  അക്ഷരം *dst;
  സ്ഥിരം അക്ഷരം *src;

  dst = vdst;
  src = vsrc;
  എങ്കിൽ (src > dst) {
    ആകുമ്പോൾ (n-- > 0)
      *dst++ = *src++;
  } അല്ലെങ്കിൽ {
    dst += n;
    src += n;
    ആകുമ്പോൾ (n-- > 0)
      *--dst = *--src;
  }
  തിരികെ vdst;
}

പൂർണ്ണസംഖ്യ
memcmp(സ്ഥിരം ശൂന്യം *s1, സ്ഥിരം ശൂന്യം *s2, uint n)
{
  സ്ഥിരം അക്ഷരം *p1 = s1, *p2 = s2;
  ആകുമ്പോൾ (n-- > 0) {
    എങ്കിൽ (*p1 != *p2) {
      തിരികെ *p1 - *p2;
    }
    p1++;
    p2++;
  }
  തിരികെ 0;
}

ശൂന്യം *
memcpy(ശൂന്യം *dst, സ്ഥിരം ശൂന്യം *src, uint n)
{
  തിരികെ memmove(dst, src, n);
}

അക്ഷരം *
sbrk(പൂർണ്ണസംഖ്യ n)
{
  തിരികെ sys_sbrk(n, SBRK_EAGER);
}

അക്ഷരം *
sbrklazy(പൂർണ്ണസംഖ്യ n)
{
  തിരികെ sys_sbrk(n, SBRK_LAZY);
}
