#अन्तर्भाव "kernel/types.h"
#अन्तर्भाव "kernel/stat.h"
#अन्तर्भाव "kernel/fcntl.h"
#अन्तर्भाव "kernel/riscv.h"
#अन्तर्भाव "kernel/vm.h"
#अन्तर्भाव "user/user.h"

//
// wrapper so that it's OK if main() does not call exit().
//
शून्य
start(पूर्णांक argc, अक्षर **argv)
{
  पूर्णांक r;
  बाह्य पूर्णांक main(पूर्णांक argc, अक्षर **argv);
  r = main(argc, argv);
  निकास(r);
}

अक्षर *
म_नकल(अक्षर *s, स्थिरांक अक्षर *t)
{
  अक्षर *os;

  os = s;
  पर्यंत ((*s++ = *t++) != 0)
    ;
  परत os;
}

पूर्णांक
म_भेद(स्थिरांक अक्षर *p, स्थिरांक अक्षर *q)
{
  पर्यंत (*p && *p == *q)
    p++, q++;
  परत (uchar)*p - (uchar)*q;
}

uint
म_माप(स्थिरांक अक्षर *s)
{
  पूर्णांक n;

  साठी (n = 0; s[n]; n++)
    ;
  परत n;
}

शून्य *
स_रखो(शून्य *dst, पूर्णांक c, uint n)
{
  अक्षर *cdst = (अक्षर *)dst;
  पूर्णांक i;
  साठी (i = 0; i < n; i++) {
    cdst[i] = c;
  }
  परत dst;
}

अक्षर *
म_अक्षर(स्थिरांक अक्षर *s, अक्षर c)
{
  साठी (; *s; s++)
    जर (*s == c)
      परत (अक्षर *)s;
  परत 0;
}

अक्षर *
माला_लो(अक्षर *buf, पूर्णांक max)
{
  पूर्णांक i, cc;
  अक्षर c;

  साठी (i = 0; i + 1 < max;) {
    cc = पठ(0, &c, 1);
    जर (cc < 1)
      थांबा;
    buf[i++] = c;
    जर (c == '\n' || c == '\r')
      थांबा;
  }
  buf[i] = '\0';
  परत buf;
}

पूर्णांक
stat(स्थिरांक अक्षर *n, संरचना stat *st)
{
  पूर्णांक fd;
  पूर्णांक r;

  fd = खोलो(n, O_RDONLY);
  जर (fd < 0)
    परत -1;
  r = ख_स्थिति(fd, st);
  बंद(fd);
  परत r;
}

पूर्णांक
म_से_प(स्थिरांक अक्षर *s)
{
  पूर्णांक n;

  n = 0;
  पर्यंत ('0' <= *s && *s <= '9')
    n = n * 10 + *s++ - '0';
  परत n;
}

शून्य *
स_हटाओ(शून्य *vdst, स्थिरांक शून्य *vsrc, पूर्णांक n)
{
  अक्षर *dst;
  स्थिरांक अक्षर *src;

  dst = vdst;
  src = vsrc;
  जर (src > dst) {
    पर्यंत (n-- > 0)
      *dst++ = *src++;
  } अन्यथा {
    dst += n;
    src += n;
    पर्यंत (n-- > 0)
      *--dst = *--src;
  }
  परत vdst;
}

पूर्णांक
स_भेद(स्थिरांक शून्य *s1, स्थिरांक शून्य *s2, uint n)
{
  स्थिरांक अक्षर *p1 = s1, *p2 = s2;
  पर्यंत (n-- > 0) {
    जर (*p1 != *p2) {
      परत *p1 - *p2;
    }
    p1++;
    p2++;
  }
  परत 0;
}

शून्य *
स_नकल(शून्य *dst, स्थिरांक शून्य *src, uint n)
{
  परत स_हटाओ(dst, src, n);
}

अक्षर *
sbrk(पूर्णांक n)
{
  परत sys_sbrk(n, SBRK_EAGER);
}

अक्षर *
sbrklazy(पूर्णांक n)
{
  परत sys_sbrk(n, SBRK_LAZY);
}
