#अन्तर्भाव "kernel/types.h"
#अन्तर्भाव "kernel/stat.h"
#अन्तर्भाव "kernel/fcntl.h"
#अन्तर्भाव "kernel/riscv.h"
#अन्तर्भाव "kernel/vm.h"
#अन्तर्भाव "user/user.h"

//
// wrapper so that it's OK if main() does not call exit().
//
शून्य
start(पूर्णाङ्क argc, वर्ण **argv)
{
  पूर्णाङ्क r;
  बाह्य पूर्णाङ्क main(पूर्णाङ्क argc, वर्ण **argv);
  r = main(argc, argv);
  निकास(r);
}

वर्ण *
म_नकल(वर्ण *s, ध्रुव वर्ण *t)
{
  वर्ण *os;

  os = s;
  यावत् ((*s++ = *t++) != 0)
    ;
  प्रत्यागम os;
}

पूर्णाङ्क
म_भेद(ध्रुव वर्ण *p, ध्रुव वर्ण *q)
{
  यावत् (*p && *p == *q)
    p++, q++;
  प्रत्यागम (uchar)*p - (uchar)*q;
}

uint
म_माप(ध्रुव वर्ण *s)
{
  पूर्णाङ्क n;

  प्रति (n = 0; s[n]; n++)
    ;
  प्रत्यागम n;
}

शून्य *
स_रखो(शून्य *dst, पूर्णाङ्क c, uint n)
{
  वर्ण *cdst = (वर्ण *)dst;
  पूर्णाङ्क i;
  प्रति (i = 0; i < n; i++) {
    cdst[i] = c;
  }
  प्रत्यागम dst;
}

वर्ण *
म_अक्षर(ध्रुव वर्ण *s, वर्ण c)
{
  प्रति (; *s; s++)
    यदि (*s == c)
      प्रत्यागम (वर्ण *)s;
  प्रत्यागम 0;
}

वर्ण *
माला_लो(वर्ण *buf, पूर्णाङ्क max)
{
  पूर्णाङ्क i, cc;
  वर्ण c;

  प्रति (i = 0; i + 1 < max;) {
    cc = पठ(0, &c, 1);
    यदि (cc < 1)
      भङ्ग;
    buf[i++] = c;
    यदि (c == '\n' || c == '\r')
      भङ्ग;
  }
  buf[i] = '\0';
  प्रत्यागम buf;
}

पूर्णाङ्क
stat(ध्रुव वर्ण *n, संरचना stat *st)
{
  पूर्णाङ्क fd;
  पूर्णाङ्क r;

  fd = खोलो(n, O_RDONLY);
  यदि (fd < 0)
    प्रत्यागम -1;
  r = ख_स्थिति(fd, st);
  बंद(fd);
  प्रत्यागम r;
}

पूर्णाङ्क
म_से_प(ध्रुव वर्ण *s)
{
  पूर्णाङ्क n;

  n = 0;
  यावत् ('0' <= *s && *s <= '9')
    n = n * 10 + *s++ - '0';
  प्रत्यागम n;
}

शून्य *
स_हटाओ(शून्य *vdst, ध्रुव शून्य *vsrc, पूर्णाङ्क n)
{
  वर्ण *dst;
  ध्रुव वर्ण *src;

  dst = vdst;
  src = vsrc;
  यदि (src > dst) {
    यावत् (n-- > 0)
      *dst++ = *src++;
  } अन्यथा {
    dst += n;
    src += n;
    यावत् (n-- > 0)
      *--dst = *--src;
  }
  प्रत्यागम vdst;
}

पूर्णाङ्क
स_भेद(ध्रुव शून्य *s1, ध्रुव शून्य *s2, uint n)
{
  ध्रुव वर्ण *p1 = s1, *p2 = s2;
  यावत् (n-- > 0) {
    यदि (*p1 != *p2) {
      प्रत्यागम *p1 - *p2;
    }
    p1++;
    p2++;
  }
  प्रत्यागम 0;
}

शून्य *
स_नकल(शून्य *dst, ध्रुव शून्य *src, uint n)
{
  प्रत्यागम स_हटाओ(dst, src, n);
}

वर्ण *
sbrk(पूर्णाङ्क n)
{
  प्रत्यागम sys_sbrk(n, SBRK_EAGER);
}

वर्ण *
sbrklazy(पूर्णाङ्क n)
{
  प्रत्यागम sys_sbrk(n, SBRK_LAZY);
}
