#समावेश "kernel/types.h"
#समावेश "kernel/stat.h"
#समावेश "kernel/fcntl.h"
#समावेश "kernel/riscv.h"
#समावेश "kernel/vm.h"
#समावेश "user/user.h"

//
// wrapper so that it's OK if main() does not call exit().
//
व्योम
start(पूर्णांक argc, अक्षर **argv)
{
  पूर्णांक r;
  बाह्य पूर्णांक मुख्य(पूर्णांक argc, अक्षर **argv);
  r = मुख्य(argc, argv);
  निकास(r);
}

अक्षर *
म_नकल(अक्षर *s, स्थिर अक्षर *t)
{
  अक्षर *os;

  os = s;
  जबतक ((*s++ = *t++) != 0)
    ;
  वापस os;
}

पूर्णांक
म_भेद(स्थिर अक्षर *p, स्थिर अक्षर *q)
{
  जबतक (*p && *p == *q)
    p++, q++;
  वापस (uchar)*p - (uchar)*q;
}

uint
म_माप(स्थिर अक्षर *s)
{
  पूर्णांक n;

  क्रम (n = 0; s[n]; n++)
    ;
  वापस n;
}

व्योम *
स_रखो(व्योम *dst, पूर्णांक c, uint n)
{
  अक्षर *cdst = (अक्षर *)dst;
  पूर्णांक i;
  क्रम (i = 0; i < n; i++) {
    cdst[i] = c;
  }
  वापस dst;
}

अक्षर *
म_अक्षर(स्थिर अक्षर *s, अक्षर c)
{
  क्रम (; *s; s++)
    अगर (*s == c)
      वापस (अक्षर *)s;
  वापस 0;
}

अक्षर *
माला_लो(अक्षर *buf, पूर्णांक max)
{
  पूर्णांक i, cc;
  अक्षर c;

  क्रम (i = 0; i + 1 < max;) {
    cc = पढ़ो(0, &c, 1);
    अगर (cc < 1)
      अवरोध;
    buf[i++] = c;
    अगर (c == '\n' || c == '\r')
      अवरोध;
  }
  buf[i] = '\0';
  वापस buf;
}

पूर्णांक
stat(स्थिर अक्षर *n, काष्ठा stat *st)
{
  पूर्णांक fd;
  पूर्णांक r;

  fd = खोलो(n, O_RDONLY);
  अगर (fd < 0)
    वापस -1;
  r = ख_स्थिति(fd, st);
  बंद(fd);
  वापस r;
}

पूर्णांक
म_से_प(स्थिर अक्षर *s)
{
  पूर्णांक n;

  n = 0;
  जबतक ('0' <= *s && *s <= '9')
    n = n * 10 + *s++ - '0';
  वापस n;
}

व्योम *
स_हटाओ(व्योम *vdst, स्थिर व्योम *vsrc, पूर्णांक n)
{
  अक्षर *dst;
  स्थिर अक्षर *src;

  dst = vdst;
  src = vsrc;
  अगर (src > dst) {
    जबतक (n-- > 0)
      *dst++ = *src++;
  } अन्यथा {
    dst += n;
    src += n;
    जबतक (n-- > 0)
      *--dst = *--src;
  }
  वापस vdst;
}

पूर्णांक
स_भेद(स्थिर व्योम *s1, स्थिर व्योम *s2, uint n)
{
  स्थिर अक्षर *p1 = s1, *p2 = s2;
  जबतक (n-- > 0) {
    अगर (*p1 != *p2) {
      वापस *p1 - *p2;
    }
    p1++;
    p2++;
  }
  वापस 0;
}

व्योम *
स_नकल(व्योम *dst, स्थिर व्योम *src, uint n)
{
  वापस स_हटाओ(dst, src, n);
}

अक्षर *
sbrk(पूर्णांक n)
{
  वापस sys_sbrk(n, SBRK_EAGER);
}

अक्षर *
sbrklazy(पूर्णांक n)
{
  वापस sys_sbrk(n, SBRK_LAZY);
}
