#అన్తర్భావ "kernel/types.h"
#అన్తర్భావ "kernel/stat.h"
#అన్తర్భావ "kernel/fcntl.h"
#అన్తర్భావ "kernel/riscv.h"
#అన్తర్భావ "kernel/vm.h"
#అన్తర్భావ "user/user.h"

//
// wrapper so that it's OK if main() does not call exit().
//
శూన్య
ప్రారంభం(పూర్ణాంకం argc, అక్షరం **argv)
{
  పూర్ణాంకం r;
  బాహ్య పూర్ణాంకం ప్రధాన(పూర్ణాంకం argc, అక్షరం **argv);
  r = ప్రధాన(argc, argv);
  నిష్క్రమించు(r);
}

అక్షరం *
strcpy(అక్షరం *s, స్థిరరాశి అక్షరం *t)
{
  అక్షరం *os;

  os = s;
  అయితే ((*s++ = *t++) != 0)
    ;
  తిరిగి os;
}

పూర్ణాంకం
strcmp(స్థిరరాశి అక్షరం *p, స్థిరరాశి అక్షరం *q)
{
  అయితే (*p && *p == *q)
    p++, q++;
  తిరిగి (uchar)*p - (uchar)*q;
}

uint
అక్షరశ్రేణి_పొడవు(స్థిరరాశి అక్షరం *s)
{
  పూర్ణాంకం n;

  కొరకు (n = 0; s[n]; n++)
    ;
  తిరిగి n;
}

శూన్య *
memset(శూన్య *dst, పూర్ణాంకం c, uint n)
{
  అక్షరం *cdst = (అక్షరం *)dst;
  పూర్ణాంకం i;
  కొరకు (i = 0; i < n; i++) {
    cdst[i] = c;
  }
  తిరిగి dst;
}

అక్షరం *
strchr(స్థిరరాశి అక్షరం *s, అక్షరం c)
{
  కొరకు (; *s; s++)
    ఒకవేళ (*s == c)
      తిరిగి (అక్షరం *)s;
  తిరిగి 0;
}

అక్షరం *
gets(అక్షరం *buf, పూర్ణాంకం max)
{
  పూర్ణాంకం i, cc;
  అక్షరం c;

  కొరకు (i = 0; i + 1 < max;) {
    cc = పఠ(0, &c, 1);
    ఒకవేళ (cc < 1)
      ఆపు;
    buf[i++] = c;
    ఒకవేళ (c == '\n' || c == '\r')
      ఆపు;
  }
  buf[i] = '\0';
  తిరిగి buf;
}

పూర్ణాంకం
stat(స్థిరరాశి అక్షరం *n, నిర్మాణం stat *st)
{
  పూర్ణాంకం fd;
  పూర్ణాంకం r;

  fd = open(n, O_RDONLY);
  ఒకవేళ (fd < 0)
    తిరిగి -1;
  r = fstat(fd, st);
  close(fd);
  తిరిగి r;
}

పూర్ణాంకం
atoi(స్థిరరాశి అక్షరం *s)
{
  పూర్ణాంకం n;

  n = 0;
  అయితే ('0' <= *s && *s <= '9')
    n = n * 10 + *s++ - '0';
  తిరిగి n;
}

శూన్య *
memmove(శూన్య *vdst, స్థిరరాశి శూన్య *vsrc, పూర్ణాంకం n)
{
  అక్షరం *dst;
  స్థిరరాశి అక్షరం *src;

  dst = vdst;
  src = vsrc;
  ఒకవేళ (src > dst) {
    అయితే (n-- > 0)
      *dst++ = *src++;
  } లేకపోతే {
    dst += n;
    src += n;
    అయితే (n-- > 0)
      *--dst = *--src;
  }
  తిరిగి vdst;
}

పూర్ణాంకం
memcmp(స్థిరరాశి శూన్య *s1, స్థిరరాశి శూన్య *s2, uint n)
{
  స్థిరరాశి అక్షరం *p1 = s1, *p2 = s2;
  అయితే (n-- > 0) {
    ఒకవేళ (*p1 != *p2) {
      తిరిగి *p1 - *p2;
    }
    p1++;
    p2++;
  }
  తిరిగి 0;
}

శూన్య *
జ్ఞాపకం_నకలు(శూన్య *dst, స్థిరరాశి శూన్య *src, uint n)
{
  తిరిగి memmove(dst, src, n);
}

అక్షరం *
sbrk(పూర్ణాంకం n)
{
  తిరిగి sys_sbrk(n, SBRK_EAGER);
}

అక్షరం *
sbrklazy(పూర్ణాంకం n)
{
  తిరిగి sys_sbrk(n, SBRK_LAZY);
}
