#define SBRK_ERROR ((অক্ষর *)-1)

কাঠামো stat;

// system calls
পূর্ণসংখ্যা fork(শূন্য);
পূর্ণসংখ্যা exit(পূর্ণসংখ্যা) __attribute__((noreturn));
পূর্ণসংখ্যা wait(পূর্ণসংখ্যা *);
পূর্ণসংখ্যা pipe(পূর্ণসংখ্যা *);
পূর্ণসংখ্যা লিখ(পূর্ণসংখ্যা, ধ্রুবক শূন্য *, পূর্ণসংখ্যা);
পূর্ণসংখ্যা পঠ(পূর্ণসংখ্যা, শূন্য *, পূর্ণসংখ্যা);
পূর্ণসংখ্যা close(পূর্ণসংখ্যা);
পূর্ণসংখ্যা kill(পূর্ণসংখ্যা);
পূর্ণসংখ্যা exec(ধ্রুবক অক্ষর *, অক্ষর **);
পূর্ণসংখ্যা open(ধ্রুবক অক্ষর *, পূর্ণসংখ্যা);
পূর্ণসংখ্যা mknod(ধ্রুবক অক্ষর *, short, short);
পূর্ণসংখ্যা unlink(ধ্রুবক অক্ষর *);
পূর্ণসংখ্যা fstat(পূর্ণসংখ্যা fd, কাঠামো stat *);
পূর্ণসংখ্যা link(ধ্রুবক অক্ষর *, ধ্রুবক অক্ষর *);
পূর্ণসংখ্যা mkdir(ধ্রুবক অক্ষর *);
পূর্ণসংখ্যা chdir(ধ্রুবক অক্ষর *);
পূর্ণসংখ্যা dup(পূর্ণসংখ্যা);
পূর্ণসংখ্যা getpid(শূন্য);
অক্ষর *sys_sbrk(পূর্ণসংখ্যা, পূর্ণসংখ্যা);
পূর্ণসংখ্যা pause(পূর্ণসংখ্যা);
পূর্ণসংখ্যা uptime(শূন্য);
পূর্ণসংখ্যা sync(শূন্য);

// ulib.c
পূর্ণসংখ্যা stat(ধ্রুবক অক্ষর *, কাঠামো stat *);
অক্ষর *strcpy(অক্ষর *, ধ্রুবক অক্ষর *);
শূন্য *memmove(শূন্য *, ধ্রুবক শূন্য *, পূর্ণসংখ্যা);
অক্ষর *strchr(ধ্রুবক অক্ষর *, অক্ষর c);
পূর্ণসংখ্যা strcmp(ধ্রুবক অক্ষর *, ধ্রুবক অক্ষর *);
অক্ষর *gets(অক্ষর *, পূর্ণসংখ্যা max);
uint strlen(ধ্রুবক অক্ষর *);
শূন্য *memset(শূন্য *, পূর্ণসংখ্যা, uint);
পূর্ণসংখ্যা atoi(ধ্রুবক অক্ষর *);
পূর্ণসংখ্যা memcmp(ধ্রুবক শূন্য *, ধ্রুবক শূন্য *, uint);
শূন্য *memcpy(শূন্য *, ধ্রুবক শূন্য *, uint);
অক্ষর *sbrk(পূর্ণসংখ্যা);
অক্ষর *sbrklazy(পূর্ণসংখ্যা);

// printf.c
শূন্য fprintf(পূর্ণসংখ্যা, ধ্রুবক অক্ষর *, ...) __attribute__((format(printf, 2, 3)));
শূন্য printf(ধ্রুবক অক্ষর *, ...) __attribute__((format(printf, 1, 2)));

// umalloc.c
শূন্য *malloc(uint);
শূন্য মুক্ত(শূন্য *);
