#define SBRK_ERROR ((எழுத்து *)-1)

கட்டமைப்பு stat;

// system calls
முழு fork(வெறுமை);
முழு exit(முழு) __attribute__((noreturn));
முழு wait(முழு *);
முழு pipe(முழு *);
முழு லிக(முழு, மாறிலி வெறுமை *, முழு);
முழு பட(முழு, வெறுமை *, முழு);
முழு close(முழு);
முழு kill(முழு);
முழு exec(மாறிலி எழுத்து *, எழுத்து **);
முழு open(மாறிலி எழுத்து *, முழு);
முழு mknod(மாறிலி எழுத்து *, short, short);
முழு unlink(மாறிலி எழுத்து *);
முழு fstat(முழு fd, கட்டமைப்பு stat *);
முழு link(மாறிலி எழுத்து *, மாறிலி எழுத்து *);
முழு mkdir(மாறிலி எழுத்து *);
முழு chdir(மாறிலி எழுத்து *);
முழு dup(முழு);
முழு getpid(வெறுமை);
எழுத்து *sys_sbrk(முழு, முழு);
முழு pause(முழு);
முழு uptime(வெறுமை);
முழு sync(வெறுமை);

// ulib.c
முழு stat(மாறிலி எழுத்து *, கட்டமைப்பு stat *);
எழுத்து *strcpy(எழுத்து *, மாறிலி எழுத்து *);
வெறுமை *memmove(வெறுமை *, மாறிலி வெறுமை *, முழு);
எழுத்து *strchr(மாறிலி எழுத்து *, எழுத்து c);
முழு strcmp(மாறிலி எழுத்து *, மாறிலி எழுத்து *);
எழுத்து *gets(எழுத்து *, முழு max);
uint strlen(மாறிலி எழுத்து *);
வெறுமை *memset(வெறுமை *, முழு, uint);
முழு atoi(மாறிலி எழுத்து *);
முழு memcmp(மாறிலி வெறுமை *, மாறிலி வெறுமை *, uint);
வெறுமை *memcpy(வெறுமை *, மாறிலி வெறுமை *, uint);
எழுத்து *sbrk(முழு);
எழுத்து *sbrklazy(முழு);

// printf.c
வெறுமை fprintf(முழு, மாறிலி எழுத்து *, ...) __attribute__((format(printf, 2, 3)));
வெறுமை printf(மாறிலி எழுத்து *, ...) __attribute__((format(printf, 1, 2)));

// umalloc.c
வெறுமை *malloc(uint);
வெறுமை விடுவி(வெறுமை *);
