#define SBRK_ERROR ((বর্ণ *)-1)

সংরচনা stat;

// system calls
পূর্ণাঙ্ক fork(শূন্য);
পূর্ণাঙ্ক exit(পূর্ণাঙ্ক) __attribute__((noreturn));
পূর্ণাঙ্ক wait(পূর্ণাঙ্ক *);
পূর্ণাঙ্ক pipe(পূর্ণাঙ্ক *);
পূর্ণাঙ্ক লিখ(পূর্ণাঙ্ক, ধ্রুব শূন্য *, পূর্ণাঙ্ক);
পূর্ণাঙ্ক পঠ(পূর্ণাঙ্ক, শূন্য *, পূর্ণাঙ্ক);
পূর্ণাঙ্ক close(পূর্ণাঙ্ক);
পূর্ণাঙ্ক kill(পূর্ণাঙ্ক);
পূর্ণাঙ্ক exec(ধ্রুব বর্ণ *, বর্ণ **);
পূর্ণাঙ্ক open(ধ্রুব বর্ণ *, পূর্ণাঙ্ক);
পূর্ণাঙ্ক mknod(ধ্রুব বর্ণ *, short, short);
পূর্ণাঙ্ক unlink(ধ্রুব বর্ণ *);
পূর্ণাঙ্ক fstat(পূর্ণাঙ্ক fd, সংরচনা stat *);
পূর্ণাঙ্ক link(ধ্রুব বর্ণ *, ধ্রুব বর্ণ *);
পূর্ণাঙ্ক mkdir(ধ্রুব বর্ণ *);
পূর্ণাঙ্ক chdir(ধ্রুব বর্ণ *);
পূর্ণাঙ্ক dup(পূর্ণাঙ্ক);
পূর্ণাঙ্ক getpid(শূন্য);
বর্ণ *sys_sbrk(পূর্ণাঙ্ক, পূর্ণাঙ্ক);
পূর্ণাঙ্ক pause(পূর্ণাঙ্ক);
পূর্ণাঙ্ক uptime(শূন্য);
পূর্ণাঙ্ক sync(শূন্য);

// ulib.c
পূর্ণাঙ্ক stat(ধ্রুব বর্ণ *, সংরচনা stat *);
বর্ণ *strcpy(বর্ণ *, ধ্রুব বর্ণ *);
শূন্য *memmove(শূন্য *, ধ্রুব শূন্য *, পূর্ণাঙ্ক);
বর্ণ *strchr(ধ্রুব বর্ণ *, বর্ণ c);
পূর্ণাঙ্ক strcmp(ধ্রুব বর্ণ *, ধ্রুব বর্ণ *);
বর্ণ *gets(বর্ণ *, পূর্ণাঙ্ক max);
uint strlen(ধ্রুব বর্ণ *);
শূন্য *memset(শূন্য *, পূর্ণাঙ্ক, uint);
পূর্ণাঙ্ক atoi(ধ্রুব বর্ণ *);
পূর্ণাঙ্ক memcmp(ধ্রুব শূন্য *, ধ্রুব শূন্য *, uint);
শূন্য *memcpy(শূন্য *, ধ্রুব শূন্য *, uint);
বর্ণ *sbrk(পূর্ণাঙ্ক);
বর্ণ *sbrklazy(পূর্ণাঙ্ক);

// printf.c
শূন্য fprintf(পূর্ণাঙ্ক, ধ্রুব বর্ণ *, ...) __attribute__((format(printf, 2, 3)));
শূন্য printf(ধ্রুব বর্ণ *, ...) __attribute__((format(printf, 1, 2)));

// umalloc.c
শূন্য *malloc(uint);
শূন্য মুক্ত(শূন্য *);
