#define SBRK_ERROR ((वर्ण *)-1)

संरचना stat;

// system calls
पूर्णाङ्क विभाजन(शून्य);
पूर्णाङ्क निकास(पूर्णाङ्क) __attribute__((noreturn));
पूर्णाङ्क रुको(पूर्णाङ्क *);
पूर्णाङ्क pipe(पूर्णाङ्क *);
पूर्णाङ्क लिख(पूर्णाङ्क, ध्रुव शून्य *, पूर्णाङ्क);
पूर्णाङ्क पठ(पूर्णाङ्क, शून्य *, पूर्णाङ्क);
पूर्णाङ्क बंद(पूर्णाङ्क);
पूर्णाङ्क समाप्त(पूर्णाङ्क);
पूर्णाङ्क exec(ध्रुव वर्ण *, वर्ण **);
पूर्णाङ्क खोलो(ध्रुव वर्ण *, पूर्णाङ्क);
पूर्णाङ्क mknod(ध्रुव वर्ण *, लघु, लघु);
पूर्णाङ्क unlink(ध्रुव वर्ण *);
पूर्णाङ्क ख_स्थिति(पूर्णाङ्क fd, संरचना stat *);
पूर्णाङ्क link(ध्रुव वर्ण *, ध्रुव वर्ण *);
पूर्णाङ्क सूची_गढ़ो(ध्रुव वर्ण *);
पूर्णाङ्क स_बदलो(ध्रुव वर्ण *);
पूर्णाङ्क dup(पूर्णाङ्क);
पूर्णाङ्क getpid(शून्य);
वर्ण *sys_sbrk(पूर्णाङ्क, पूर्णाङ्क);
पूर्णाङ्क छोड़ो(पूर्णाङ्क);
पूर्णाङ्क uptime(शून्य);
पूर्णाङ्क sync(शून्य);

// ulib.c
पूर्णाङ्क stat(ध्रुव वर्ण *, संरचना stat *);
वर्ण *म_नकल(वर्ण *, ध्रुव वर्ण *);
शून्य *स_हटाओ(शून्य *, ध्रुव शून्य *, पूर्णाङ्क);
वर्ण *म_अक्षर(ध्रुव वर्ण *, वर्ण c);
पूर्णाङ्क म_भेद(ध्रुव वर्ण *, ध्रुव वर्ण *);
वर्ण *माला_लो(वर्ण *, पूर्णाङ्क max);
uint म_माप(ध्रुव वर्ण *);
शून्य *स_रखो(शून्य *, पूर्णाङ्क, uint);
पूर्णाङ्क म_से_प(ध्रुव वर्ण *);
पूर्णाङ्क स_भेद(ध्रुव शून्य *, ध्रुव शून्य *, uint);
शून्य *स_नकल(शून्य *, ध्रुव शून्य *, uint);
वर्ण *sbrk(पूर्णाङ्क);
वर्ण *sbrklazy(पूर्णाङ्क);

// printf.c
शून्य ख_लिखो(पूर्णाङ्क, ध्रुव वर्ण *, ...) __attribute__((format(म_लिखो, 2, 3)));
शून्य म_लिखो(ध्रुव वर्ण *, ...) __attribute__((format(म_लिखो, 1, 2)));

// umalloc.c
शून्य *दो_स्मृति(uint);
शून्य मुक्त(शून्य *);
