#घोषणा SBRK_ERROR ((अक्षर *)-1)

काष्ठा stat;

// system calls
पूर्णांक विभाजन(व्योम);
पूर्णांक निकास(पूर्णांक) __attribute__((noreturn));
पूर्णांक रुको(पूर्णांक *);
पूर्णांक pipe(पूर्णांक *);
पूर्णांक ग_लिखो(पूर्णांक, स्थिर व्योम *, पूर्णांक);
पूर्णांक पढ़ो(पूर्णांक, व्योम *, पूर्णांक);
पूर्णांक बंद(पूर्णांक);
पूर्णांक समाप्त(पूर्णांक);
पूर्णांक exec(स्थिर अक्षर *, अक्षर **);
पूर्णांक खोलो(स्थिर अक्षर *, पूर्णांक);
पूर्णांक mknod(स्थिर अक्षर *, लघु, लघु);
पूर्णांक unlink(स्थिर अक्षर *);
पूर्णांक ख_स्थिति(पूर्णांक fd, काष्ठा stat *);
पूर्णांक link(स्थिर अक्षर *, स्थिर अक्षर *);
पूर्णांक सूची_गढ़ो(स्थिर अक्षर *);
पूर्णांक स_बदलो(स्थिर अक्षर *);
पूर्णांक dup(पूर्णांक);
पूर्णांक getpid(व्योम);
अक्षर *sys_sbrk(पूर्णांक, पूर्णांक);
पूर्णांक छोड़ो(पूर्णांक);
पूर्णांक uptime(व्योम);
पूर्णांक sync(व्योम);

// ulib.c
पूर्णांक stat(स्थिर अक्षर *, काष्ठा stat *);
अक्षर *म_नकल(अक्षर *, स्थिर अक्षर *);
व्योम *स_हटाओ(व्योम *, स्थिर व्योम *, पूर्णांक);
अक्षर *म_अक्षर(स्थिर अक्षर *, अक्षर c);
पूर्णांक म_भेद(स्थिर अक्षर *, स्थिर अक्षर *);
अक्षर *माला_लो(अक्षर *, पूर्णांक max);
uint म_माप(स्थिर अक्षर *);
व्योम *स_रखो(व्योम *, पूर्णांक, uint);
पूर्णांक म_से_प(स्थिर अक्षर *);
पूर्णांक स_भेद(स्थिर व्योम *, स्थिर व्योम *, uint);
व्योम *स_नकल(व्योम *, स्थिर व्योम *, uint);
अक्षर *sbrk(पूर्णांक);
अक्षर *sbrklazy(पूर्णांक);

// printf.c
व्योम ख_लिखो(पूर्णांक, स्थिर अक्षर *, ...) __attribute__((format(म_लिखो, 2, 3)));
व्योम म_लिखो(स्थिर अक्षर *, ...) __attribute__((format(म_लिखो, 1, 2)));

// umalloc.c
व्योम *दो_स्मृति(uint);
व्योम मुक्त(व्योम *);
