#تعریف_کرو SBRK_ERROR ((حرف *)-1)

ساخت stat;

// system calls
صحیح fork(خالی);
صحیح باہر_نکلو(صحیح) __attribute__((noreturn));
صحیح wait(صحیح *);
صحیح pipe(صحیح *);
صحیح اكتب(صحیح, ثابت خالی *, صحیح);
صحیح اقرأ(صحیح, خالی *, صحیح);
صحیح close(صحیح);
صحیح kill(صحیح);
صحیح exec(ثابت حرف *, حرف **);
صحیح open(ثابت حرف *, صحیح);
صحیح mknod(ثابت حرف *, مختصر, مختصر);
صحیح unlink(ثابت حرف *);
صحیح fstat(صحیح fd, ساخت stat *);
صحیح link(ثابت حرف *, ثابت حرف *);
صحیح mkdir(ثابت حرف *);
صحیح chdir(ثابت حرف *);
صحیح dup(صحیح);
صحیح getpid(خالی);
حرف *sys_sbrk(صحیح, صحیح);
صحیح pause(صحیح);
صحیح uptime(خالی);
صحیح sync(خالی);

// ulib.c
صحیح stat(ثابت حرف *, ساخت stat *);
حرف *strcpy(حرف *, ثابت حرف *);
خالی *memmove(خالی *, ثابت خالی *, صحیح);
حرف *strchr(ثابت حرف *, حرف c);
صحیح strcmp(ثابت حرف *, ثابت حرف *);
حرف *gets(حرف *, صحیح max);
uint لڑی_لمبائی(ثابت حرف *);
خالی *memset(خالی *, صحیح, uint);
صحیح atoi(ثابت حرف *);
صحیح memcmp(ثابت خالی *, ثابت خالی *, uint);
خالی *حافظہ_نقل(خالی *, ثابت خالی *, uint);
حرف *sbrk(صحیح);
حرف *sbrklazy(صحیح);

// printf.c
خالی fprintf(صحیح, ثابت حرف *, ...) __attribute__((format(لکھو, 2, 3)));
خالی لکھو(ثابت حرف *, ...) __attribute__((format(لکھو, 1, 2)));

// umalloc.c
خالی *حافظہ_دو(uint);
خالی آزاد(خالی *);
