#define SBRK_ERROR ((അക്ഷരം *)-1)

ഘടന stat;

// system calls
പൂർണ്ണസംഖ്യ fork(ശൂന്യം);
പൂർണ്ണസംഖ്യ exit(പൂർണ്ണസംഖ്യ) __attribute__((noreturn));
പൂർണ്ണസംഖ്യ wait(പൂർണ്ണസംഖ്യ *);
പൂർണ്ണസംഖ്യ pipe(പൂർണ്ണസംഖ്യ *);
പൂർണ്ണസംഖ്യ ലിഖ(പൂർണ്ണസംഖ്യ, സ്ഥിരം ശൂന്യം *, പൂർണ്ണസംഖ്യ);
പൂർണ്ണസംഖ്യ പഠ(പൂർണ്ണസംഖ്യ, ശൂന്യം *, പൂർണ്ണസംഖ്യ);
പൂർണ്ണസംഖ്യ close(പൂർണ്ണസംഖ്യ);
പൂർണ്ണസംഖ്യ kill(പൂർണ്ണസംഖ്യ);
പൂർണ്ണസംഖ്യ exec(സ്ഥിരം അക്ഷരം *, അക്ഷരം **);
പൂർണ്ണസംഖ്യ open(സ്ഥിരം അക്ഷരം *, പൂർണ്ണസംഖ്യ);
പൂർണ്ണസംഖ്യ mknod(സ്ഥിരം അക്ഷരം *, short, short);
പൂർണ്ണസംഖ്യ unlink(സ്ഥിരം അക്ഷരം *);
പൂർണ്ണസംഖ്യ fstat(പൂർണ്ണസംഖ്യ fd, ഘടന stat *);
പൂർണ്ണസംഖ്യ link(സ്ഥിരം അക്ഷരം *, സ്ഥിരം അക്ഷരം *);
പൂർണ്ണസംഖ്യ mkdir(സ്ഥിരം അക്ഷരം *);
പൂർണ്ണസംഖ്യ chdir(സ്ഥിരം അക്ഷരം *);
പൂർണ്ണസംഖ്യ dup(പൂർണ്ണസംഖ്യ);
പൂർണ്ണസംഖ്യ getpid(ശൂന്യം);
അക്ഷരം *sys_sbrk(പൂർണ്ണസംഖ്യ, പൂർണ്ണസംഖ്യ);
പൂർണ്ണസംഖ്യ pause(പൂർണ്ണസംഖ്യ);
പൂർണ്ണസംഖ്യ uptime(ശൂന്യം);
പൂർണ്ണസംഖ്യ sync(ശൂന്യം);

// ulib.c
പൂർണ്ണസംഖ്യ stat(സ്ഥിരം അക്ഷരം *, ഘടന stat *);
അക്ഷരം *strcpy(അക്ഷരം *, സ്ഥിരം അക്ഷരം *);
ശൂന്യം *memmove(ശൂന്യം *, സ്ഥിരം ശൂന്യം *, പൂർണ്ണസംഖ്യ);
അക്ഷരം *strchr(സ്ഥിരം അക്ഷരം *, അക്ഷരം c);
പൂർണ്ണസംഖ്യ strcmp(സ്ഥിരം അക്ഷരം *, സ്ഥിരം അക്ഷരം *);
അക്ഷരം *gets(അക്ഷരം *, പൂർണ്ണസംഖ്യ max);
uint strlen(സ്ഥിരം അക്ഷരം *);
ശൂന്യം *memset(ശൂന്യം *, പൂർണ്ണസംഖ്യ, uint);
പൂർണ്ണസംഖ്യ atoi(സ്ഥിരം അക്ഷരം *);
പൂർണ്ണസംഖ്യ memcmp(സ്ഥിരം ശൂന്യം *, സ്ഥിരം ശൂന്യം *, uint);
ശൂന്യം *memcpy(ശൂന്യം *, സ്ഥിരം ശൂന്യം *, uint);
അക്ഷരം *sbrk(പൂർണ്ണസംഖ്യ);
അക്ഷരം *sbrklazy(പൂർണ്ണസംഖ്യ);

// printf.c
ശൂന്യം fprintf(പൂർണ്ണസംഖ്യ, സ്ഥിരം അക്ഷരം *, ...) __attribute__((format(printf, 2, 3)));
ശൂന്യം printf(സ്ഥിരം അക്ഷരം *, ...) __attribute__((format(printf, 1, 2)));

// umalloc.c
ശൂന്യം *malloc(uint);
ശൂന്യം സ്വതന്ത്രം(ശൂന്യം *);
