#ವ್ಯಾಖ್ಯಾನಿಸು SBRK_ERROR ((ಅಕ್ಷರ *)-1)

ರಚನೆ stat;

// system calls
ಪೂರ್ಣಾಂಕ fork(ಶೂನ್ಯ);
ಪೂರ್ಣಾಂಕ ನಿರ್ಗಮಿಸು(ಪೂರ್ಣಾಂಕ) __attribute__((noreturn));
ಪೂರ್ಣಾಂಕ wait(ಪೂರ್ಣಾಂಕ *);
ಪೂರ್ಣಾಂಕ pipe(ಪೂರ್ಣಾಂಕ *);
ಪೂರ್ಣಾಂಕ ಲಿಖ(ಪೂರ್ಣಾಂಕ, ಸ್ಥಿರಾಂಕ ಶೂನ್ಯ *, ಪೂರ್ಣಾಂಕ);
ಪೂರ್ಣಾಂಕ ಪಠ(ಪೂರ್ಣಾಂಕ, ಶೂನ್ಯ *, ಪೂರ್ಣಾಂಕ);
ಪೂರ್ಣಾಂಕ close(ಪೂರ್ಣಾಂಕ);
ಪೂರ್ಣಾಂಕ kill(ಪೂರ್ಣಾಂಕ);
ಪೂರ್ಣಾಂಕ exec(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *, ಅಕ್ಷರ **);
ಪೂರ್ಣಾಂಕ open(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *, ಪೂರ್ಣಾಂಕ);
ಪೂರ್ಣಾಂಕ mknod(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *, ಗಿಡ್ಡ, ಗಿಡ್ಡ);
ಪೂರ್ಣಾಂಕ unlink(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *);
ಪೂರ್ಣಾಂಕ fstat(ಪೂರ್ಣಾಂಕ fd, ರಚನೆ stat *);
ಪೂರ್ಣಾಂಕ link(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *, ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *);
ಪೂರ್ಣಾಂಕ mkdir(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *);
ಪೂರ್ಣಾಂಕ chdir(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *);
ಪೂರ್ಣಾಂಕ dup(ಪೂರ್ಣಾಂಕ);
ಪೂರ್ಣಾಂಕ getpid(ಶೂನ್ಯ);
ಅಕ್ಷರ *sys_sbrk(ಪೂರ್ಣಾಂಕ, ಪೂರ್ಣಾಂಕ);
ಪೂರ್ಣಾಂಕ pause(ಪೂರ್ಣಾಂಕ);
ಪೂರ್ಣಾಂಕ uptime(ಶೂನ್ಯ);
ಪೂರ್ಣಾಂಕ sync(ಶೂನ್ಯ);

// ulib.c
ಪೂರ್ಣಾಂಕ stat(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *, ರಚನೆ stat *);
ಅಕ್ಷರ *strcpy(ಅಕ್ಷರ *, ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *);
ಶೂನ್ಯ *memmove(ಶೂನ್ಯ *, ಸ್ಥಿರಾಂಕ ಶೂನ್ಯ *, ಪೂರ್ಣಾಂಕ);
ಅಕ್ಷರ *strchr(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *, ಅಕ್ಷರ c);
ಪೂರ್ಣಾಂಕ strcmp(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *, ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *);
ಅಕ್ಷರ *gets(ಅಕ್ಷರ *, ಪೂರ್ಣಾಂಕ max);
uint ಅಕ್ಷರಸರಣಿ_ಉದ್ದ(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *);
ಶೂನ್ಯ *memset(ಶೂನ್ಯ *, ಪೂರ್ಣಾಂಕ, uint);
ಪೂರ್ಣಾಂಕ atoi(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *);
ಪೂರ್ಣಾಂಕ memcmp(ಸ್ಥಿರಾಂಕ ಶೂನ್ಯ *, ಸ್ಥಿರಾಂಕ ಶೂನ್ಯ *, uint);
ಶೂನ್ಯ *ಸ್ಮರಣೆ_ನಕಲು(ಶೂನ್ಯ *, ಸ್ಥಿರಾಂಕ ಶೂನ್ಯ *, uint);
ಅಕ್ಷರ *sbrk(ಪೂರ್ಣಾಂಕ);
ಅಕ್ಷರ *sbrklazy(ಪೂರ್ಣಾಂಕ);

// printf.c
ಶೂನ್ಯ fprintf(ಪೂರ್ಣಾಂಕ, ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *, ...) __attribute__((format(ಬರೆ, 2, 3)));
ಶೂನ್ಯ ಬರೆ(ಸ್ಥಿರಾಂಕ ಅಕ್ಷರ *, ...) __attribute__((format(ಬರೆ, 1, 2)));

// umalloc.c
ಶೂನ್ಯ *ಸ್ಮರಣೆ_ಕೊಡು(uint);
ಶೂನ್ಯ ಬಿಡುಗಡೆ(ಶೂನ್ಯ *);
