#define SBRK_ERROR ((ৱর্ণ *)-1)

সংরচনা stat;

// system calls
পূর্ণাঙ্ক fork(শূন্য);
পূর্ণাঙ্ক exit(পূর্ণাঙ্ক) __attribute__((noreturn));
পূর্ণাঙ্ক wait(পূর্ণাঙ্ক *);
পূর্ণাঙ্ক pipe(পূর্ণাঙ্ক *);
পূর্ণাঙ্ক লিখ(পূর্ণাঙ্ক, ধ্রুৱ শূন্য *, পূর্ণাঙ্ক);
পূর্ণাঙ্ক পঠ(পূর্ণাঙ্ক, শূন্য *, পূর্ণাঙ্ক);
পূর্ণাঙ্ক close(পূর্ণাঙ্ক);
পূর্ণাঙ্ক kill(পূর্ণাঙ্ক);
পূর্ণাঙ্ক exec(ধ্রুৱ ৱর্ণ *, ৱর্ণ **);
পূর্ণাঙ্ক open(ধ্রুৱ ৱর্ণ *, পূর্ণাঙ্ক);
পূর্ণাঙ্ক mknod(ধ্রুৱ ৱর্ণ *, short, short);
পূর্ণাঙ্ক unlink(ধ্রুৱ ৱর্ণ *);
পূর্ণাঙ্ক fstat(পূর্ণাঙ্ক fd, সংরচনা stat *);
পূর্ণাঙ্ক link(ধ্রুৱ ৱর্ণ *, ধ্রুৱ ৱর্ণ *);
পূর্ণাঙ্ক mkdir(ধ্রুৱ ৱর্ণ *);
পূর্ণাঙ্ক chdir(ধ্রুৱ ৱর্ণ *);
পূর্ণাঙ্ক dup(পূর্ণাঙ্ক);
পূর্ণাঙ্ক getpid(শূন্য);
ৱর্ণ *sys_sbrk(পূর্ণাঙ্ক, পূর্ণাঙ্ক);
পূর্ণাঙ্ক pause(পূর্ণাঙ্ক);
পূর্ণাঙ্ক uptime(শূন্য);
পূর্ণাঙ্ক sync(শূন্য);

// ulib.c
পূর্ণাঙ্ক stat(ধ্রুৱ ৱর্ণ *, সংরচনা stat *);
ৱর্ণ *strcpy(ৱর্ণ *, ধ্রুৱ ৱর্ণ *);
শূন্য *memmove(শূন্য *, ধ্রুৱ শূন্য *, পূর্ণাঙ্ক);
ৱর্ণ *strchr(ধ্রুৱ ৱর্ণ *, ৱর্ণ c);
পূর্ণাঙ্ক strcmp(ধ্রুৱ ৱর্ণ *, ধ্রুৱ ৱর্ণ *);
ৱর্ণ *gets(ৱর্ণ *, পূর্ণাঙ্ক max);
uint strlen(ধ্রুৱ ৱর্ণ *);
শূন্য *memset(শূন্য *, পূর্ণাঙ্ক, uint);
পূর্ণাঙ্ক atoi(ধ্রুৱ ৱর্ণ *);
পূর্ণাঙ্ক memcmp(ধ্রুৱ শূন্য *, ধ্রুৱ শূন্য *, uint);
শূন্য *memcpy(শূন্য *, ধ্রুৱ শূন্য *, uint);
ৱর্ণ *sbrk(পূর্ণাঙ্ক);
ৱর্ণ *sbrklazy(পূর্ণাঙ্ক);

// printf.c
শূন্য fprintf(পূর্ণাঙ্ক, ধ্রুৱ ৱর্ণ *, ...) __attribute__((format(printf, 2, 3)));
শূন্য printf(ধ্রুৱ ৱর্ণ *, ...) __attribute__((format(printf, 1, 2)));

// umalloc.c
শূন্য *malloc(uint);
শূন্য মুক্ত(শূন্য *);
