#परिभाषय SBRK_ERROR ((वर्ण *)-1)

संरचना stat;

// system calls
पूर्णाङ्क fork(शून्य);
पूर्णाङ्क निर्गच्छ(पूर्णाङ्क) __attribute__((noreturn));
पूर्णाङ्क प्रतीक्षस्व(पूर्णाङ्क *);
पूर्णाङ्क pipe(पूर्णाङ्क *);
पूर्णाङ्क लिख(पूर्णाङ्क, ध्रुव शून्य *, पूर्णाङ्क);
पूर्णाङ्क पठ(पूर्णाङ्क, शून्य *, पूर्णाङ्क);
पूर्णाङ्क close(पूर्णाङ्क);
पूर्णाङ्क kill(पूर्णाङ्क);
पूर्णाङ्क exec(ध्रुव वर्ण *, वर्ण **);
पूर्णाङ्क उद्घाटय(ध्रुव वर्ण *, पूर्णाङ्क);
पूर्णाङ्क mknod(ध्रुव वर्ण *, ह्रस्व, ह्रस्व);
पूर्णाङ्क unlink(ध्रुव वर्ण *);
पूर्णाङ्क fstat(पूर्णाङ्क fd, संरचना stat *);
पूर्णाङ्क link(ध्रुव वर्ण *, ध्रुव वर्ण *);
पूर्णाङ्क mkdir(ध्रुव वर्ण *);
पूर्णाङ्क chdir(ध्रुव वर्ण *);
पूर्णाङ्क dup(पूर्णाङ्क);
पूर्णाङ्क getpid(शून्य);
वर्ण *sys_sbrk(पूर्णाङ्क, पूर्णाङ्क);
पूर्णाङ्क pause(पूर्णाङ्क);
पूर्णाङ्क uptime(शून्य);
पूर्णाङ्क sync(शून्य);

// ulib.c
पूर्णाङ्क stat(ध्रुव वर्ण *, संरचना stat *);
वर्ण *वाक्यं_प्रतिलिख(वर्ण *, ध्रुव वर्ण *);
शून्य *memmove(शून्य *, ध्रुव शून्य *, पूर्णाङ्क);
वर्ण *strchr(ध्रुव वर्ण *, वर्ण c);
पूर्णाङ्क वाक्यं_तुलय(ध्रुव वर्ण *, ध्रुव वर्ण *);
वर्ण *gets(वर्ण *, पूर्णाङ्क max);
uint वाक्यदैर्घ्यम्(ध्रुव वर्ण *);
शून्य *स्मृतिं_पूरय(शून्य *, पूर्णाङ्क, uint);
पूर्णाङ्क atoi(ध्रुव वर्ण *);
पूर्णाङ्क memcmp(ध्रुव शून्य *, ध्रुव शून्य *, uint);
शून्य *स्मृतिं_प्रतिलिख(शून्य *, ध्रुव शून्य *, uint);
वर्ण *sbrk(पूर्णाङ्क);
वर्ण *sbrklazy(पूर्णाङ्क);

// printf.c
शून्य fprintf(पूर्णाङ्क, ध्रुव वर्ण *, ...) __attribute__((format(प्रारूप_लिख, 2, 3)));
शून्य प्रारूप_लिख(ध्रुव वर्ण *, ...) __attribute__((format(प्रारूप_लिख, 1, 2)));

// umalloc.c
शून्य *स्मृतिं_देहि(uint);
शून्य मुक्त(शून्य *);
