#ਪਰਿਭਾਸ਼ਿਤ_ਕਰੋ SBRK_ERROR ((ਅੱਖਰ *)-1)

ਬਣਤਰ stat;

// system calls
ਪੂਰਨ fork(ਖਾਲੀ);
ਪੂਰਨ ਬਾਹਰ_ਨਿਕਲੋ(ਪੂਰਨ) __attribute__((noreturn));
ਪੂਰਨ wait(ਪੂਰਨ *);
ਪੂਰਨ pipe(ਪੂਰਨ *);
ਪੂਰਨ ਲਿਖ(ਪੂਰਨ, ਅਚਲ ਖਾਲੀ *, ਪੂਰਨ);
ਪੂਰਨ ਪਠ(ਪੂਰਨ, ਖਾਲੀ *, ਪੂਰਨ);
ਪੂਰਨ close(ਪੂਰਨ);
ਪੂਰਨ kill(ਪੂਰਨ);
ਪੂਰਨ exec(ਅਚਲ ਅੱਖਰ *, ਅੱਖਰ **);
ਪੂਰਨ open(ਅਚਲ ਅੱਖਰ *, ਪੂਰਨ);
ਪੂਰਨ mknod(ਅਚਲ ਅੱਖਰ *, ਛੋਟਾ, ਛੋਟਾ);
ਪੂਰਨ unlink(ਅਚਲ ਅੱਖਰ *);
ਪੂਰਨ fstat(ਪੂਰਨ fd, ਬਣਤਰ stat *);
ਪੂਰਨ link(ਅਚਲ ਅੱਖਰ *, ਅਚਲ ਅੱਖਰ *);
ਪੂਰਨ mkdir(ਅਚਲ ਅੱਖਰ *);
ਪੂਰਨ chdir(ਅਚਲ ਅੱਖਰ *);
ਪੂਰਨ dup(ਪੂਰਨ);
ਪੂਰਨ getpid(ਖਾਲੀ);
ਅੱਖਰ *sys_sbrk(ਪੂਰਨ, ਪੂਰਨ);
ਪੂਰਨ pause(ਪੂਰਨ);
ਪੂਰਨ uptime(ਖਾਲੀ);
ਪੂਰਨ sync(ਖਾਲੀ);

// ulib.c
ਪੂਰਨ stat(ਅਚਲ ਅੱਖਰ *, ਬਣਤਰ stat *);
ਅੱਖਰ *strcpy(ਅੱਖਰ *, ਅਚਲ ਅੱਖਰ *);
ਖਾਲੀ *memmove(ਖਾਲੀ *, ਅਚਲ ਖਾਲੀ *, ਪੂਰਨ);
ਅੱਖਰ *strchr(ਅਚਲ ਅੱਖਰ *, ਅੱਖਰ c);
ਪੂਰਨ strcmp(ਅਚਲ ਅੱਖਰ *, ਅਚਲ ਅੱਖਰ *);
ਅੱਖਰ *gets(ਅੱਖਰ *, ਪੂਰਨ max);
uint ਲੜੀ_ਲੰਬਾਈ(ਅਚਲ ਅੱਖਰ *);
ਖਾਲੀ *memset(ਖਾਲੀ *, ਪੂਰਨ, uint);
ਪੂਰਨ atoi(ਅਚਲ ਅੱਖਰ *);
ਪੂਰਨ memcmp(ਅਚਲ ਖਾਲੀ *, ਅਚਲ ਖਾਲੀ *, uint);
ਖਾਲੀ *ਸਮ੍ਰਿਤੀ_ਨਕਲ(ਖਾਲੀ *, ਅਚਲ ਖਾਲੀ *, uint);
ਅੱਖਰ *sbrk(ਪੂਰਨ);
ਅੱਖਰ *sbrklazy(ਪੂਰਨ);

// printf.c
ਖਾਲੀ fprintf(ਪੂਰਨ, ਅਚਲ ਅੱਖਰ *, ...) __attribute__((format(ਲਿਖੋ, 2, 3)));
ਖਾਲੀ ਲਿਖੋ(ਅਚਲ ਅੱਖਰ *, ...) __attribute__((format(ਲਿਖੋ, 1, 2)));

// umalloc.c
ਖਾਲੀ *ਸਮ੍ਰਿਤੀ_ਦਿਓ(uint);
ਖਾਲੀ ਮੁਕਤ(ਖਾਲੀ *);
